import 'package:kanu/Model/sub_songs_model.dart';
import 'package:kanu/Widgets/sub_songs_images_listview_widget.dart';

class SubSongsScreenData {
  static List subImagesURL = [
    'images/western.PNG',
    'images/eastern.PNG',
  ];
  // the same data for all songs .. for saving time
  static List<SubSongsModel> subSongsData(
      {required double height, required double width}) {
    List<SubSongsModel> sItem = [
      SubSongsModel(
        pDescription:
            'Freeze Dance is a fun modern game song to engage kids and play them and have them move around, jump, shake, and dance. It has lots of benefits as it encourages kids to not be sitting for long time, thus helps their joins to be flexible; it is great for auditory processing and responding; it strengthens awareness and attention and body control; and it is a great way to improve balance whether static when stopping or dynamic when moving.',
        pFeatures: 'Western Lyrics:\n' +
            'ܬܳܟ̥ܽܘ ܡ݄ܫܬܰܥܺܝܢܰܐ ܗ̄ܽܘ ܫܽܘܥܝܳܐ ܕܽܗ̄ܘ ܪܰܩܕܳܐ ! ܡܰܚܶܬܽܘ ܒܒܳܠܰܝܟ̥ܽܘ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ، ܓ݄ܕܟܳܠܺܝܬܽܘ ! ܘܕܳܐܡܰܪ ܐ̱ܢܳܐ ܪܩܰܕܽܘ، ܓ݄ܕܪ݄ܩܕܺܝܬܽܘ ! \n' +
            'ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܪܩܰܕܽܘ... ܪܩܰܕܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ ! \n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܩܦܳܣܳܐ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !\n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܗܝܳܙܳܐ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !\n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܒܪܳܡܳܐ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !\n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܪܰܩܕܳܐ ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܪܩܰܕܽܘ... ܪܩܰܕܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !',
        pCredits: 'Eastern Lyrics:\n' +
            'ܬܹܐ ܡܘܿܢ ܡܛܲܐܠܲܚ ܠܲܡܛܲܐܲܠܬܵܐ ܕܪܸܩܕܵܐ! ܡܲܬܘܿܒ݂ܘܿܢ ܒܒܵܠܵܘܟ݂ܘܿܢ. ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ، ܒܟܵܠܝܼܬܘܿܢ! ܘܐܸܢ ܐܵܡܪܸܢ ܪܩܘܿܕܘܿܢ، ܒܪܵܩܕܝܼܬܘܿܢ!\n' +
            'ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܒܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ!\n' +
            'ܗܵܕܝܼܵܐ ܡܛܲܝܒ݂ܘܿܢ ܢܲܦ̮ܫܵܘܟ݂ܘܿܢ ܠܲܫܘܵܪܵܐ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܡ̣ܢ ܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ!\n' +
            'ܗܵܕܝܼܵܐ ܡܛܲܝܒ݂ܘܿܢ ܢܲܦ̮ܫܵܘܟ݂ܘܿܢ ܠܲܫܥܵܫܵܐ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܡ̣ܢ ܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ\n' +
            'ܗܵܕܝܼܵܐ ܡܛܲܝܒ݂ܘܿܢ ܢܲܦ̮ܫܵܘܟ݂ܘܿܢ ܠܲܦܬܵܠܵܐ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܡ̣ܢ ܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ\n' +
            'ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܒܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ!',
        pSubImages: SubSongsImagesListViewWidget(
            subImagesCount: subImagesURL.length,
            subImagesURL: subImagesURL,
            containerHeight: height * 1 / 4,
            imageWidth: width * 3 / 8,
            imageHeight: height * 3 / 16),
      ),
      SubSongsModel(
        pDescription:
            'Freeze Dance is a fun modern game song to engage kids and play them and have them move around, jump, shake, and dance. It has lots of benefits as it encourages kids to not be sitting for long time, thus helps their joins to be flexible; it is great for auditory processing and responding; it strengthens awareness and attention and body control; and it is a great way to improve balance whether static when stopping or dynamic when moving.',
        pFeatures: 'Western Lyrics:\n' +
            'ܬܳܟ̥ܽܘ ܡ݄ܫܬܰܥܺܝܢܰܐ ܗ̄ܽܘ ܫܽܘܥܝܳܐ ܕܽܗ̄ܘ ܪܰܩܕܳܐ ! ܡܰܚܶܬܽܘ ܒܒܳܠܰܝܟ̥ܽܘ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ، ܓ݄ܕܟܳܠܺܝܬܽܘ ! ܘܕܳܐܡܰܪ ܐ̱ܢܳܐ ܪܩܰܕܽܘ، ܓ݄ܕܪ݄ܩܕܺܝܬܽܘ ! \n' +
            'ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܪܩܰܕܽܘ... ܪܩܰܕܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ ! \n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܩܦܳܣܳܐ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !\n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܗܝܳܙܳܐ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !\n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܒܪܳܡܳܐ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !\n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܪܰܩܕܳܐ ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܪܩܰܕܽܘ... ܪܩܰܕܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !',
        pCredits: 'Eastern Lyrics:\n' +
            'ܬܹܐ ܡܘܿܢ ܡܛܲܐܠܲܚ ܠܲܡܛܲܐܲܠܬܵܐ ܕܪܸܩܕܵܐ! ܡܲܬܘܿܒ݂ܘܿܢ ܒܒܵܠܵܘܟ݂ܘܿܢ. ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ، ܒܟܵܠܝܼܬܘܿܢ! ܘܐܸܢ ܐܵܡܪܸܢ ܪܩܘܿܕܘܿܢ، ܒܪܵܩܕܝܼܬܘܿܢ!\n' +
            'ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܒܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ!\n' +
            'ܗܵܕܝܼܵܐ ܡܛܲܝܒ݂ܘܿܢ ܢܲܦ̮ܫܵܘܟ݂ܘܿܢ ܠܲܫܘܵܪܵܐ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܡ̣ܢ ܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ!\n' +
            'ܗܵܕܝܼܵܐ ܡܛܲܝܒ݂ܘܿܢ ܢܲܦ̮ܫܵܘܟ݂ܘܿܢ ܠܲܫܥܵܫܵܐ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܡ̣ܢ ܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ\n' +
            'ܗܵܕܝܼܵܐ ܡܛܲܝܒ݂ܘܿܢ ܢܲܦ̮ܫܵܘܟ݂ܘܿܢ ܠܲܦܬܵܠܵܐ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܡ̣ܢ ܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ\n' +
            'ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܒܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ!',
        pSubImages: SubSongsImagesListViewWidget(
            subImagesCount: subImagesURL.length,
            subImagesURL: subImagesURL,
            containerHeight: height * 1 / 4,
            imageWidth: width * 3 / 8,
            imageHeight: height * 3 / 16),
      ),
      SubSongsModel(
        pDescription:
            'Freeze Dance is a fun modern game song to engage kids and play them and have them move around, jump, shake, and dance. It has lots of benefits as it encourages kids to not be sitting for long time, thus helps their joins to be flexible; it is great for auditory processing and responding; it strengthens awareness and attention and body control; and it is a great way to improve balance whether static when stopping or dynamic when moving.',
        pFeatures: 'Western Lyrics:\n' +
            'ܬܳܟ̥ܽܘ ܡ݄ܫܬܰܥܺܝܢܰܐ ܗ̄ܽܘ ܫܽܘܥܝܳܐ ܕܽܗ̄ܘ ܪܰܩܕܳܐ ! ܡܰܚܶܬܽܘ ܒܒܳܠܰܝܟ̥ܽܘ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ، ܓ݄ܕܟܳܠܺܝܬܽܘ ! ܘܕܳܐܡܰܪ ܐ̱ܢܳܐ ܪܩܰܕܽܘ، ܓ݄ܕܪ݄ܩܕܺܝܬܽܘ ! \n' +
            'ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܪܩܰܕܽܘ... ܪܩܰܕܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ ! \n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܩܦܳܣܳܐ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !\n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܗܝܳܙܳܐ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !\n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܒܪܳܡܳܐ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !\n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܪܰܩܕܳܐ ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܪܩܰܕܽܘ... ܪܩܰܕܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !',
        pCredits: 'Eastern Lyrics:\n' +
            'ܬܹܐ ܡܘܿܢ ܡܛܲܐܠܲܚ ܠܲܡܛܲܐܲܠܬܵܐ ܕܪܸܩܕܵܐ! ܡܲܬܘܿܒ݂ܘܿܢ ܒܒܵܠܵܘܟ݂ܘܿܢ. ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ، ܒܟܵܠܝܼܬܘܿܢ! ܘܐܸܢ ܐܵܡܪܸܢ ܪܩܘܿܕܘܿܢ، ܒܪܵܩܕܝܼܬܘܿܢ!\n' +
            'ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܒܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ!\n' +
            'ܗܵܕܝܼܵܐ ܡܛܲܝܒ݂ܘܿܢ ܢܲܦ̮ܫܵܘܟ݂ܘܿܢ ܠܲܫܘܵܪܵܐ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܡ̣ܢ ܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ!\n' +
            'ܗܵܕܝܼܵܐ ܡܛܲܝܒ݂ܘܿܢ ܢܲܦ̮ܫܵܘܟ݂ܘܿܢ ܠܲܫܥܵܫܵܐ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܡ̣ܢ ܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ\n' +
            'ܗܵܕܝܼܵܐ ܡܛܲܝܒ݂ܘܿܢ ܢܲܦ̮ܫܵܘܟ݂ܘܿܢ ܠܲܦܬܵܠܵܐ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܡ̣ܢ ܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ\n' +
            'ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܒܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ!',
        pSubImages: SubSongsImagesListViewWidget(
            subImagesCount: subImagesURL.length,
            subImagesURL: subImagesURL,
            containerHeight: height * 1 / 4,
            imageWidth: width * 3 / 8,
            imageHeight: height * 3 / 16),
      ),
      SubSongsModel(
        pDescription:
            'Freeze Dance is a fun modern game song to engage kids and play them and have them move around, jump, shake, and dance. It has lots of benefits as it encourages kids to not be sitting for long time, thus helps their joins to be flexible; it is great for auditory processing and responding; it strengthens awareness and attention and body control; and it is a great way to improve balance whether static when stopping or dynamic when moving.',
        pFeatures: 'Western Lyrics:\n' +
            'ܬܳܟ̥ܽܘ ܡ݄ܫܬܰܥܺܝܢܰܐ ܗ̄ܽܘ ܫܽܘܥܝܳܐ ܕܽܗ̄ܘ ܪܰܩܕܳܐ ! ܡܰܚܶܬܽܘ ܒܒܳܠܰܝܟ̥ܽܘ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ، ܓ݄ܕܟܳܠܺܝܬܽܘ ! ܘܕܳܐܡܰܪ ܐ̱ܢܳܐ ܪܩܰܕܽܘ، ܓ݄ܕܪ݄ܩܕܺܝܬܽܘ ! \n' +
            'ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܪܩܰܕܽܘ... ܪܩܰܕܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ ! \n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܩܦܳܣܳܐ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !\n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܗܝܳܙܳܐ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !\n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܒܪܳܡܳܐ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !\n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܪܰܩܕܳܐ ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܪܩܰܕܽܘ... ܪܩܰܕܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !',
        pCredits: 'Eastern Lyrics:\n' +
            'ܬܹܐ ܡܘܿܢ ܡܛܲܐܠܲܚ ܠܲܡܛܲܐܲܠܬܵܐ ܕܪܸܩܕܵܐ! ܡܲܬܘܿܒ݂ܘܿܢ ܒܒܵܠܵܘܟ݂ܘܿܢ. ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ، ܒܟܵܠܝܼܬܘܿܢ! ܘܐܸܢ ܐܵܡܪܸܢ ܪܩܘܿܕܘܿܢ، ܒܪܵܩܕܝܼܬܘܿܢ!\n' +
            'ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܒܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ!\n' +
            'ܗܵܕܝܼܵܐ ܡܛܲܝܒ݂ܘܿܢ ܢܲܦ̮ܫܵܘܟ݂ܘܿܢ ܠܲܫܘܵܪܵܐ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܡ̣ܢ ܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ!\n' +
            'ܗܵܕܝܼܵܐ ܡܛܲܝܒ݂ܘܿܢ ܢܲܦ̮ܫܵܘܟ݂ܘܿܢ ܠܲܫܥܵܫܵܐ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܡ̣ܢ ܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ\n' +
            'ܗܵܕܝܼܵܐ ܡܛܲܝܒ݂ܘܿܢ ܢܲܦ̮ܫܵܘܟ݂ܘܿܢ ܠܲܦܬܵܠܵܐ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܡ̣ܢ ܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ\n' +
            'ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܒܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ!',
        pSubImages: SubSongsImagesListViewWidget(
            subImagesCount: subImagesURL.length,
            subImagesURL: subImagesURL,
            containerHeight: height * 1 / 4,
            imageWidth: width * 3 / 8,
            imageHeight: height * 3 / 16),
      ),
      SubSongsModel(
        pDescription:
            'Freeze Dance is a fun modern game song to engage kids and play them and have them move around, jump, shake, and dance. It has lots of benefits as it encourages kids to not be sitting for long time, thus helps their joins to be flexible; it is great for auditory processing and responding; it strengthens awareness and attention and body control; and it is a great way to improve balance whether static when stopping or dynamic when moving.',
        pFeatures: 'Western Lyrics:\n' +
            'ܬܳܟ̥ܽܘ ܡ݄ܫܬܰܥܺܝܢܰܐ ܗ̄ܽܘ ܫܽܘܥܝܳܐ ܕܽܗ̄ܘ ܪܰܩܕܳܐ ! ܡܰܚܶܬܽܘ ܒܒܳܠܰܝܟ̥ܽܘ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ، ܓ݄ܕܟܳܠܺܝܬܽܘ ! ܘܕܳܐܡܰܪ ܐ̱ܢܳܐ ܪܩܰܕܽܘ، ܓ݄ܕܪ݄ܩܕܺܝܬܽܘ ! \n' +
            'ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܪܩܰܕܽܘ... ܪܩܰܕܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ ! \n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܩܦܳܣܳܐ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !\n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܗܝܳܙܳܐ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !\n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܒܪܳܡܳܐ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !\n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܪܰܩܕܳܐ ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܪܩܰܕܽܘ... ܪܩܰܕܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !',
        pCredits: 'Eastern Lyrics:\n' +
            'ܬܹܐ ܡܘܿܢ ܡܛܲܐܠܲܚ ܠܲܡܛܲܐܲܠܬܵܐ ܕܪܸܩܕܵܐ! ܡܲܬܘܿܒ݂ܘܿܢ ܒܒܵܠܵܘܟ݂ܘܿܢ. ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ، ܒܟܵܠܝܼܬܘܿܢ! ܘܐܸܢ ܐܵܡܪܸܢ ܪܩܘܿܕܘܿܢ، ܒܪܵܩܕܝܼܬܘܿܢ!\n' +
            'ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܒܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ!\n' +
            'ܗܵܕܝܼܵܐ ܡܛܲܝܒ݂ܘܿܢ ܢܲܦ̮ܫܵܘܟ݂ܘܿܢ ܠܲܫܘܵܪܵܐ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܡ̣ܢ ܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ!\n' +
            'ܗܵܕܝܼܵܐ ܡܛܲܝܒ݂ܘܿܢ ܢܲܦ̮ܫܵܘܟ݂ܘܿܢ ܠܲܫܥܵܫܵܐ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܡ̣ܢ ܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ\n' +
            'ܗܵܕܝܼܵܐ ܡܛܲܝܒ݂ܘܿܢ ܢܲܦ̮ܫܵܘܟ݂ܘܿܢ ܠܲܦܬܵܠܵܐ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܡ̣ܢ ܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ\n' +
            'ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܒܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ!',
        pSubImages: SubSongsImagesListViewWidget(
            subImagesCount: subImagesURL.length,
            subImagesURL: subImagesURL,
            containerHeight: height * 1 / 4,
            imageWidth: width * 3 / 8,
            imageHeight: height * 3 / 16),
      ),
      SubSongsModel(
        pDescription:
            'Freeze Dance is a fun modern game song to engage kids and play them and have them move around, jump, shake, and dance. It has lots of benefits as it encourages kids to not be sitting for long time, thus helps their joins to be flexible; it is great for auditory processing and responding; it strengthens awareness and attention and body control; and it is a great way to improve balance whether static when stopping or dynamic when moving.',
        pFeatures: 'Western Lyrics:\n' +
            'ܬܳܟ̥ܽܘ ܡ݄ܫܬܰܥܺܝܢܰܐ ܗ̄ܽܘ ܫܽܘܥܝܳܐ ܕܽܗ̄ܘ ܪܰܩܕܳܐ ! ܡܰܚܶܬܽܘ ܒܒܳܠܰܝܟ̥ܽܘ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ، ܓ݄ܕܟܳܠܺܝܬܽܘ ! ܘܕܳܐܡܰܪ ܐ̱ܢܳܐ ܪܩܰܕܽܘ، ܓ݄ܕܪ݄ܩܕܺܝܬܽܘ ! \n' +
            'ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܪܩܰܕܽܘ... ܪܩܰܕܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ ! \n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܩܦܳܣܳܐ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !\n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܗܝܳܙܳܐ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !\n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܒܪܳܡܳܐ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !\n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܪܰܩܕܳܐ ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܪܩܰܕܽܘ... ܪܩܰܕܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !',
        pCredits: 'Eastern Lyrics:\n' +
            'ܬܹܐ ܡܘܿܢ ܡܛܲܐܠܲܚ ܠܲܡܛܲܐܲܠܬܵܐ ܕܪܸܩܕܵܐ! ܡܲܬܘܿܒ݂ܘܿܢ ܒܒܵܠܵܘܟ݂ܘܿܢ. ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ، ܒܟܵܠܝܼܬܘܿܢ! ܘܐܸܢ ܐܵܡܪܸܢ ܪܩܘܿܕܘܿܢ، ܒܪܵܩܕܝܼܬܘܿܢ!\n' +
            'ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܒܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ!\n' +
            'ܗܵܕܝܼܵܐ ܡܛܲܝܒ݂ܘܿܢ ܢܲܦ̮ܫܵܘܟ݂ܘܿܢ ܠܲܫܘܵܪܵܐ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܡ̣ܢ ܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ!\n' +
            'ܗܵܕܝܼܵܐ ܡܛܲܝܒ݂ܘܿܢ ܢܲܦ̮ܫܵܘܟ݂ܘܿܢ ܠܲܫܥܵܫܵܐ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܡ̣ܢ ܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ\n' +
            'ܗܵܕܝܼܵܐ ܡܛܲܝܒ݂ܘܿܢ ܢܲܦ̮ܫܵܘܟ݂ܘܿܢ ܠܲܦܬܵܠܵܐ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܡ̣ܢ ܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ\n' +
            'ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܒܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ!',
        pSubImages: SubSongsImagesListViewWidget(
            subImagesCount: subImagesURL.length,
            subImagesURL: subImagesURL,
            containerHeight: height * 1 / 4,
            imageWidth: width * 3 / 8,
            imageHeight: height * 3 / 16),
      ),
      SubSongsModel(
        pDescription:
            'Freeze Dance is a fun modern game song to engage kids and play them and have them move around, jump, shake, and dance. It has lots of benefits as it encourages kids to not be sitting for long time, thus helps their joins to be flexible; it is great for auditory processing and responding; it strengthens awareness and attention and body control; and it is a great way to improve balance whether static when stopping or dynamic when moving.',
        pFeatures: 'Western Lyrics:\n' +
            'ܬܳܟ̥ܽܘ ܡ݄ܫܬܰܥܺܝܢܰܐ ܗ̄ܽܘ ܫܽܘܥܝܳܐ ܕܽܗ̄ܘ ܪܰܩܕܳܐ ! ܡܰܚܶܬܽܘ ܒܒܳܠܰܝܟ̥ܽܘ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ، ܓ݄ܕܟܳܠܺܝܬܽܘ ! ܘܕܳܐܡܰܪ ܐ̱ܢܳܐ ܪܩܰܕܽܘ، ܓ݄ܕܪ݄ܩܕܺܝܬܽܘ ! \n' +
            'ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܪܩܰܕܽܘ... ܪܩܰܕܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ ! \n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܩܦܳܣܳܐ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !\n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܗܝܳܙܳܐ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !\n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܒܪܳܡܳܐ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !\n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܪܰܩܕܳܐ ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܪܩܰܕܽܘ... ܪܩܰܕܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !',
        pCredits: 'Eastern Lyrics:\n' +
            'ܬܹܐ ܡܘܿܢ ܡܛܲܐܠܲܚ ܠܲܡܛܲܐܲܠܬܵܐ ܕܪܸܩܕܵܐ! ܡܲܬܘܿܒ݂ܘܿܢ ܒܒܵܠܵܘܟ݂ܘܿܢ. ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ، ܒܟܵܠܝܼܬܘܿܢ! ܘܐܸܢ ܐܵܡܪܸܢ ܪܩܘܿܕܘܿܢ، ܒܪܵܩܕܝܼܬܘܿܢ!\n' +
            'ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܒܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ!\n' +
            'ܗܵܕܝܼܵܐ ܡܛܲܝܒ݂ܘܿܢ ܢܲܦ̮ܫܵܘܟ݂ܘܿܢ ܠܲܫܘܵܪܵܐ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܡ̣ܢ ܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ!\n' +
            'ܗܵܕܝܼܵܐ ܡܛܲܝܒ݂ܘܿܢ ܢܲܦ̮ܫܵܘܟ݂ܘܿܢ ܠܲܫܥܵܫܵܐ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܡ̣ܢ ܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ\n' +
            'ܗܵܕܝܼܵܐ ܡܛܲܝܒ݂ܘܿܢ ܢܲܦ̮ܫܵܘܟ݂ܘܿܢ ܠܲܦܬܵܠܵܐ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܡ̣ܢ ܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ\n' +
            'ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܒܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ!',
        pSubImages: SubSongsImagesListViewWidget(
            subImagesCount: subImagesURL.length,
            subImagesURL: subImagesURL,
            containerHeight: height * 1 / 4,
            imageWidth: width * 3 / 8,
            imageHeight: height * 3 / 16),
      ),
      SubSongsModel(
        pDescription:
            'Freeze Dance is a fun modern game song to engage kids and play them and have them move around, jump, shake, and dance. It has lots of benefits as it encourages kids to not be sitting for long time, thus helps their joins to be flexible; it is great for auditory processing and responding; it strengthens awareness and attention and body control; and it is a great way to improve balance whether static when stopping or dynamic when moving.',
        pFeatures: 'Western Lyrics:\n' +
            'ܬܳܟ̥ܽܘ ܡ݄ܫܬܰܥܺܝܢܰܐ ܗ̄ܽܘ ܫܽܘܥܝܳܐ ܕܽܗ̄ܘ ܪܰܩܕܳܐ ! ܡܰܚܶܬܽܘ ܒܒܳܠܰܝܟ̥ܽܘ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ، ܓ݄ܕܟܳܠܺܝܬܽܘ ! ܘܕܳܐܡܰܪ ܐ̱ܢܳܐ ܪܩܰܕܽܘ، ܓ݄ܕܪ݄ܩܕܺܝܬܽܘ ! \n' +
            'ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܪܩܰܕܽܘ... ܪܩܰܕܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ ! \n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܩܦܳܣܳܐ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !\n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܗܝܳܙܳܐ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !\n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܒܪܳܡܳܐ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !\n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܪܰܩܕܳܐ ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܪܩܰܕܽܘ... ܪܩܰܕܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !',
        pCredits: 'Eastern Lyrics:\n' +
            'ܬܹܐ ܡܘܿܢ ܡܛܲܐܠܲܚ ܠܲܡܛܲܐܲܠܬܵܐ ܕܪܸܩܕܵܐ! ܡܲܬܘܿܒ݂ܘܿܢ ܒܒܵܠܵܘܟ݂ܘܿܢ. ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ، ܒܟܵܠܝܼܬܘܿܢ! ܘܐܸܢ ܐܵܡܪܸܢ ܪܩܘܿܕܘܿܢ، ܒܪܵܩܕܝܼܬܘܿܢ!\n' +
            'ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܒܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ!\n' +
            'ܗܵܕܝܼܵܐ ܡܛܲܝܒ݂ܘܿܢ ܢܲܦ̮ܫܵܘܟ݂ܘܿܢ ܠܲܫܘܵܪܵܐ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܡ̣ܢ ܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ!\n' +
            'ܗܵܕܝܼܵܐ ܡܛܲܝܒ݂ܘܿܢ ܢܲܦ̮ܫܵܘܟ݂ܘܿܢ ܠܲܫܥܵܫܵܐ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܡ̣ܢ ܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ\n' +
            'ܗܵܕܝܼܵܐ ܡܛܲܝܒ݂ܘܿܢ ܢܲܦ̮ܫܵܘܟ݂ܘܿܢ ܠܲܦܬܵܠܵܐ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܡ̣ܢ ܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ\n' +
            'ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܒܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ!',
        pSubImages: SubSongsImagesListViewWidget(
            subImagesCount: subImagesURL.length,
            subImagesURL: subImagesURL,
            containerHeight: height * 1 / 4,
            imageWidth: width * 3 / 8,
            imageHeight: height * 3 / 16),
      ),
      SubSongsModel(
        pDescription:
            'Freeze Dance is a fun modern game song to engage kids and play them and have them move around, jump, shake, and dance. It has lots of benefits as it encourages kids to not be sitting for long time, thus helps their joins to be flexible; it is great for auditory processing and responding; it strengthens awareness and attention and body control; and it is a great way to improve balance whether static when stopping or dynamic when moving.',
        pFeatures: 'Western Lyrics:\n' +
            'ܬܳܟ̥ܽܘ ܡ݄ܫܬܰܥܺܝܢܰܐ ܗ̄ܽܘ ܫܽܘܥܝܳܐ ܕܽܗ̄ܘ ܪܰܩܕܳܐ ! ܡܰܚܶܬܽܘ ܒܒܳܠܰܝܟ̥ܽܘ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ، ܓ݄ܕܟܳܠܺܝܬܽܘ ! ܘܕܳܐܡܰܪ ܐ̱ܢܳܐ ܪܩܰܕܽܘ، ܓ݄ܕܪ݄ܩܕܺܝܬܽܘ ! \n' +
            'ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܪܩܰܕܽܘ... ܪܩܰܕܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ ! \n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܩܦܳܣܳܐ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !\n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܗܝܳܙܳܐ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !\n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܒܪܳܡܳܐ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !\n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܪܰܩܕܳܐ ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܪܩܰܕܽܘ... ܪܩܰܕܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !',
        pCredits: 'Eastern Lyrics:\n' +
            'ܬܹܐ ܡܘܿܢ ܡܛܲܐܠܲܚ ܠܲܡܛܲܐܲܠܬܵܐ ܕܪܸܩܕܵܐ! ܡܲܬܘܿܒ݂ܘܿܢ ܒܒܵܠܵܘܟ݂ܘܿܢ. ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ، ܒܟܵܠܝܼܬܘܿܢ! ܘܐܸܢ ܐܵܡܪܸܢ ܪܩܘܿܕܘܿܢ، ܒܪܵܩܕܝܼܬܘܿܢ!\n' +
            'ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܒܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ!\n' +
            'ܗܵܕܝܼܵܐ ܡܛܲܝܒ݂ܘܿܢ ܢܲܦ̮ܫܵܘܟ݂ܘܿܢ ܠܲܫܘܵܪܵܐ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܡ̣ܢ ܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ!\n' +
            'ܗܵܕܝܼܵܐ ܡܛܲܝܒ݂ܘܿܢ ܢܲܦ̮ܫܵܘܟ݂ܘܿܢ ܠܲܫܥܵܫܵܐ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܡ̣ܢ ܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ\n' +
            'ܗܵܕܝܼܵܐ ܡܛܲܝܒ݂ܘܿܢ ܢܲܦ̮ܫܵܘܟ݂ܘܿܢ ܠܲܦܬܵܠܵܐ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܡ̣ܢ ܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ\n' +
            'ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܒܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ!',
        pSubImages: SubSongsImagesListViewWidget(
            subImagesCount: subImagesURL.length,
            subImagesURL: subImagesURL,
            containerHeight: height * 1 / 4,
            imageWidth: width * 3 / 8,
            imageHeight: height * 3 / 16),
      ),
      SubSongsModel(
        pDescription:
            'Freeze Dance is a fun modern game song to engage kids and play them and have them move around, jump, shake, and dance. It has lots of benefits as it encourages kids to not be sitting for long time, thus helps their joins to be flexible; it is great for auditory processing and responding; it strengthens awareness and attention and body control; and it is a great way to improve balance whether static when stopping or dynamic when moving.',
        pFeatures: 'Western Lyrics:\n' +
            'ܬܳܟ̥ܽܘ ܡ݄ܫܬܰܥܺܝܢܰܐ ܗ̄ܽܘ ܫܽܘܥܝܳܐ ܕܽܗ̄ܘ ܪܰܩܕܳܐ ! ܡܰܚܶܬܽܘ ܒܒܳܠܰܝܟ̥ܽܘ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ، ܓ݄ܕܟܳܠܺܝܬܽܘ ! ܘܕܳܐܡܰܪ ܐ̱ܢܳܐ ܪܩܰܕܽܘ، ܓ݄ܕܪ݄ܩܕܺܝܬܽܘ ! \n' +
            'ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܪܩܰܕܽܘ... ܪܩܰܕܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ ! \n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܩܦܳܣܳܐ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !\n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܗܝܳܙܳܐ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !\n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܒܪܳܡܳܐ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !\n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܪܰܩܕܳܐ ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܪܩܰܕܽܘ... ܪܩܰܕܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !',
        pCredits: 'Eastern Lyrics:\n' +
            'ܬܹܐ ܡܘܿܢ ܡܛܲܐܠܲܚ ܠܲܡܛܲܐܲܠܬܵܐ ܕܪܸܩܕܵܐ! ܡܲܬܘܿܒ݂ܘܿܢ ܒܒܵܠܵܘܟ݂ܘܿܢ. ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ، ܒܟܵܠܝܼܬܘܿܢ! ܘܐܸܢ ܐܵܡܪܸܢ ܪܩܘܿܕܘܿܢ، ܒܪܵܩܕܝܼܬܘܿܢ!\n' +
            'ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܒܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ!\n' +
            'ܗܵܕܝܼܵܐ ܡܛܲܝܒ݂ܘܿܢ ܢܲܦ̮ܫܵܘܟ݂ܘܿܢ ܠܲܫܘܵܪܵܐ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܡ̣ܢ ܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ!\n' +
            'ܗܵܕܝܼܵܐ ܡܛܲܝܒ݂ܘܿܢ ܢܲܦ̮ܫܵܘܟ݂ܘܿܢ ܠܲܫܥܵܫܵܐ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܡ̣ܢ ܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ\n' +
            'ܗܵܕܝܼܵܐ ܡܛܲܝܒ݂ܘܿܢ ܢܲܦ̮ܫܵܘܟ݂ܘܿܢ ܠܲܦܬܵܠܵܐ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܡ̣ܢ ܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ\n' +
            'ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܒܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ!',
        pSubImages: SubSongsImagesListViewWidget(
            subImagesCount: subImagesURL.length,
            subImagesURL: subImagesURL,
            containerHeight: height * 1 / 4,
            imageWidth: width * 3 / 8,
            imageHeight: height * 3 / 16),
      ),
      SubSongsModel(
        pDescription:
            'Freeze Dance is a fun modern game song to engage kids and play them and have them move around, jump, shake, and dance. It has lots of benefits as it encourages kids to not be sitting for long time, thus helps their joins to be flexible; it is great for auditory processing and responding; it strengthens awareness and attention and body control; and it is a great way to improve balance whether static when stopping or dynamic when moving.',
        pFeatures: 'Western Lyrics:\n' +
            'ܬܳܟ̥ܽܘ ܡ݄ܫܬܰܥܺܝܢܰܐ ܗ̄ܽܘ ܫܽܘܥܝܳܐ ܕܽܗ̄ܘ ܪܰܩܕܳܐ ! ܡܰܚܶܬܽܘ ܒܒܳܠܰܝܟ̥ܽܘ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ، ܓ݄ܕܟܳܠܺܝܬܽܘ ! ܘܕܳܐܡܰܪ ܐ̱ܢܳܐ ܪܩܰܕܽܘ، ܓ݄ܕܪ݄ܩܕܺܝܬܽܘ ! \n' +
            'ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܪܩܰܕܽܘ... ܪܩܰܕܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ ! \n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܩܦܳܣܳܐ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !\n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܗܝܳܙܳܐ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !\n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܒܪܳܡܳܐ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !\n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܪܰܩܕܳܐ ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܪܩܰܕܽܘ... ܪܩܰܕܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !',
        pCredits: 'Eastern Lyrics:\n' +
            'ܬܹܐ ܡܘܿܢ ܡܛܲܐܠܲܚ ܠܲܡܛܲܐܲܠܬܵܐ ܕܪܸܩܕܵܐ! ܡܲܬܘܿܒ݂ܘܿܢ ܒܒܵܠܵܘܟ݂ܘܿܢ. ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ، ܒܟܵܠܝܼܬܘܿܢ! ܘܐܸܢ ܐܵܡܪܸܢ ܪܩܘܿܕܘܿܢ، ܒܪܵܩܕܝܼܬܘܿܢ!\n' +
            'ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܒܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ!\n' +
            'ܗܵܕܝܼܵܐ ܡܛܲܝܒ݂ܘܿܢ ܢܲܦ̮ܫܵܘܟ݂ܘܿܢ ܠܲܫܘܵܪܵܐ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܡ̣ܢ ܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ!\n' +
            'ܗܵܕܝܼܵܐ ܡܛܲܝܒ݂ܘܿܢ ܢܲܦ̮ܫܵܘܟ݂ܘܿܢ ܠܲܫܥܵܫܵܐ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܡ̣ܢ ܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ\n' +
            'ܗܵܕܝܼܵܐ ܡܛܲܝܒ݂ܘܿܢ ܢܲܦ̮ܫܵܘܟ݂ܘܿܢ ܠܲܦܬܵܠܵܐ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܡ̣ܢ ܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ\n' +
            'ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܒܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ!',
        pSubImages: SubSongsImagesListViewWidget(
            subImagesCount: subImagesURL.length,
            subImagesURL: subImagesURL,
            containerHeight: height * 1 / 4,
            imageWidth: width * 3 / 8,
            imageHeight: height * 3 / 16),
      ),
      SubSongsModel(
        pDescription:
            'Freeze Dance is a fun modern game song to engage kids and play them and have them move around, jump, shake, and dance. It has lots of benefits as it encourages kids to not be sitting for long time, thus helps their joins to be flexible; it is great for auditory processing and responding; it strengthens awareness and attention and body control; and it is a great way to improve balance whether static when stopping or dynamic when moving.',
        pFeatures: 'Western Lyrics:\n' +
            'ܬܳܟ̥ܽܘ ܡ݄ܫܬܰܥܺܝܢܰܐ ܗ̄ܽܘ ܫܽܘܥܝܳܐ ܕܽܗ̄ܘ ܪܰܩܕܳܐ ! ܡܰܚܶܬܽܘ ܒܒܳܠܰܝܟ̥ܽܘ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ، ܓ݄ܕܟܳܠܺܝܬܽܘ ! ܘܕܳܐܡܰܪ ܐ̱ܢܳܐ ܪܩܰܕܽܘ، ܓ݄ܕܪ݄ܩܕܺܝܬܽܘ ! \n' +
            'ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܪܩܰܕܽܘ... ܪܩܰܕܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ ! \n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܩܦܳܣܳܐ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !\n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܗܝܳܙܳܐ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !\n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܒܪܳܡܳܐ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !\n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܪܰܩܕܳܐ ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܪܩܰܕܽܘ... ܪܩܰܕܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !',
        pCredits: 'Eastern Lyrics:\n' +
            'ܬܹܐ ܡܘܿܢ ܡܛܲܐܠܲܚ ܠܲܡܛܲܐܲܠܬܵܐ ܕܪܸܩܕܵܐ! ܡܲܬܘܿܒ݂ܘܿܢ ܒܒܵܠܵܘܟ݂ܘܿܢ. ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ، ܒܟܵܠܝܼܬܘܿܢ! ܘܐܸܢ ܐܵܡܪܸܢ ܪܩܘܿܕܘܿܢ، ܒܪܵܩܕܝܼܬܘܿܢ!\n' +
            'ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܒܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ!\n' +
            'ܗܵܕܝܼܵܐ ܡܛܲܝܒ݂ܘܿܢ ܢܲܦ̮ܫܵܘܟ݂ܘܿܢ ܠܲܫܘܵܪܵܐ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܡ̣ܢ ܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ!\n' +
            'ܗܵܕܝܼܵܐ ܡܛܲܝܒ݂ܘܿܢ ܢܲܦ̮ܫܵܘܟ݂ܘܿܢ ܠܲܫܥܵܫܵܐ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܡ̣ܢ ܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ\n' +
            'ܗܵܕܝܼܵܐ ܡܛܲܝܒ݂ܘܿܢ ܢܲܦ̮ܫܵܘܟ݂ܘܿܢ ܠܲܦܬܵܠܵܐ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܡ̣ܢ ܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ\n' +
            'ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܒܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ!',
        pSubImages: SubSongsImagesListViewWidget(
            subImagesCount: subImagesURL.length,
            subImagesURL: subImagesURL,
            containerHeight: height * 1 / 4,
            imageWidth: width * 3 / 8,
            imageHeight: height * 3 / 16),
      ),
      SubSongsModel(
        pDescription:
            'Freeze Dance is a fun modern game song to engage kids and play them and have them move around, jump, shake, and dance. It has lots of benefits as it encourages kids to not be sitting for long time, thus helps their joins to be flexible; it is great for auditory processing and responding; it strengthens awareness and attention and body control; and it is a great way to improve balance whether static when stopping or dynamic when moving.',
        pFeatures: 'Western Lyrics:\n' +
            'ܬܳܟ̥ܽܘ ܡ݄ܫܬܰܥܺܝܢܰܐ ܗ̄ܽܘ ܫܽܘܥܝܳܐ ܕܽܗ̄ܘ ܪܰܩܕܳܐ ! ܡܰܚܶܬܽܘ ܒܒܳܠܰܝܟ̥ܽܘ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ، ܓ݄ܕܟܳܠܺܝܬܽܘ ! ܘܕܳܐܡܰܪ ܐ̱ܢܳܐ ܪܩܰܕܽܘ، ܓ݄ܕܪ݄ܩܕܺܝܬܽܘ ! \n' +
            'ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܪܩܰܕܽܘ... ܪܩܰܕܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ ! \n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܩܦܳܣܳܐ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !\n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܗܝܳܙܳܐ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !\n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܒܪܳܡܳܐ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !\n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܪܰܩܕܳܐ ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܪܩܰܕܽܘ... ܪܩܰܕܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !',
        pCredits: 'Eastern Lyrics:\n' +
            'ܬܹܐ ܡܘܿܢ ܡܛܲܐܠܲܚ ܠܲܡܛܲܐܲܠܬܵܐ ܕܪܸܩܕܵܐ! ܡܲܬܘܿܒ݂ܘܿܢ ܒܒܵܠܵܘܟ݂ܘܿܢ. ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ، ܒܟܵܠܝܼܬܘܿܢ! ܘܐܸܢ ܐܵܡܪܸܢ ܪܩܘܿܕܘܿܢ، ܒܪܵܩܕܝܼܬܘܿܢ!\n' +
            'ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܒܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ!\n' +
            'ܗܵܕܝܼܵܐ ܡܛܲܝܒ݂ܘܿܢ ܢܲܦ̮ܫܵܘܟ݂ܘܿܢ ܠܲܫܘܵܪܵܐ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܡ̣ܢ ܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ!\n' +
            'ܗܵܕܝܼܵܐ ܡܛܲܝܒ݂ܘܿܢ ܢܲܦ̮ܫܵܘܟ݂ܘܿܢ ܠܲܫܥܵܫܵܐ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܡ̣ܢ ܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ\n' +
            'ܗܵܕܝܼܵܐ ܡܛܲܝܒ݂ܘܿܢ ܢܲܦ̮ܫܵܘܟ݂ܘܿܢ ܠܲܦܬܵܠܵܐ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܡ̣ܢ ܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ\n' +
            'ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܒܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ!',
        pSubImages: SubSongsImagesListViewWidget(
            subImagesCount: subImagesURL.length,
            subImagesURL: subImagesURL,
            containerHeight: height * 1 / 4,
            imageWidth: width * 3 / 8,
            imageHeight: height * 3 / 16),
      ),
      SubSongsModel(
        pDescription:
            'Freeze Dance is a fun modern game song to engage kids and play them and have them move around, jump, shake, and dance. It has lots of benefits as it encourages kids to not be sitting for long time, thus helps their joins to be flexible; it is great for auditory processing and responding; it strengthens awareness and attention and body control; and it is a great way to improve balance whether static when stopping or dynamic when moving.',
        pFeatures: 'Western Lyrics:\n' +
            'ܬܳܟ̥ܽܘ ܡ݄ܫܬܰܥܺܝܢܰܐ ܗ̄ܽܘ ܫܽܘܥܝܳܐ ܕܽܗ̄ܘ ܪܰܩܕܳܐ ! ܡܰܚܶܬܽܘ ܒܒܳܠܰܝܟ̥ܽܘ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ، ܓ݄ܕܟܳܠܺܝܬܽܘ ! ܘܕܳܐܡܰܪ ܐ̱ܢܳܐ ܪܩܰܕܽܘ، ܓ݄ܕܪ݄ܩܕܺܝܬܽܘ ! \n' +
            'ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܪܩܰܕܽܘ... ܪܩܰܕܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ ! \n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܩܦܳܣܳܐ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !\n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܗܝܳܙܳܐ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !\n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܒܪܳܡܳܐ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !\n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܪܰܩܕܳܐ ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܪܩܰܕܽܘ... ܪܩܰܕܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !',
        pCredits: 'Eastern Lyrics:\n' +
            'ܬܹܐ ܡܘܿܢ ܡܛܲܐܠܲܚ ܠܲܡܛܲܐܲܠܬܵܐ ܕܪܸܩܕܵܐ! ܡܲܬܘܿܒ݂ܘܿܢ ܒܒܵܠܵܘܟ݂ܘܿܢ. ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ، ܒܟܵܠܝܼܬܘܿܢ! ܘܐܸܢ ܐܵܡܪܸܢ ܪܩܘܿܕܘܿܢ، ܒܪܵܩܕܝܼܬܘܿܢ!\n' +
            'ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܒܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ!\n' +
            'ܗܵܕܝܼܵܐ ܡܛܲܝܒ݂ܘܿܢ ܢܲܦ̮ܫܵܘܟ݂ܘܿܢ ܠܲܫܘܵܪܵܐ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܡ̣ܢ ܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ!\n' +
            'ܗܵܕܝܼܵܐ ܡܛܲܝܒ݂ܘܿܢ ܢܲܦ̮ܫܵܘܟ݂ܘܿܢ ܠܲܫܥܵܫܵܐ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܡ̣ܢ ܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ\n' +
            'ܗܵܕܝܼܵܐ ܡܛܲܝܒ݂ܘܿܢ ܢܲܦ̮ܫܵܘܟ݂ܘܿܢ ܠܲܦܬܵܠܵܐ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܡ̣ܢ ܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ\n' +
            'ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܒܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ!',
        pSubImages: SubSongsImagesListViewWidget(
            subImagesCount: subImagesURL.length,
            subImagesURL: subImagesURL,
            containerHeight: height * 1 / 4,
            imageWidth: width * 3 / 8,
            imageHeight: height * 3 / 16),
      ),
      SubSongsModel(
        pDescription:
            'Freeze Dance is a fun modern game song to engage kids and play them and have them move around, jump, shake, and dance. It has lots of benefits as it encourages kids to not be sitting for long time, thus helps their joins to be flexible; it is great for auditory processing and responding; it strengthens awareness and attention and body control; and it is a great way to improve balance whether static when stopping or dynamic when moving.',
        pFeatures: 'Western Lyrics:\n' +
            'ܬܳܟ̥ܽܘ ܡ݄ܫܬܰܥܺܝܢܰܐ ܗ̄ܽܘ ܫܽܘܥܝܳܐ ܕܽܗ̄ܘ ܪܰܩܕܳܐ ! ܡܰܚܶܬܽܘ ܒܒܳܠܰܝܟ̥ܽܘ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ، ܓ݄ܕܟܳܠܺܝܬܽܘ ! ܘܕܳܐܡܰܪ ܐ̱ܢܳܐ ܪܩܰܕܽܘ، ܓ݄ܕܪ݄ܩܕܺܝܬܽܘ ! \n' +
            'ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܪܩܰܕܽܘ... ܪܩܰܕܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ ! \n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܩܦܳܣܳܐ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !\n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܗܝܳܙܳܐ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !\n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܒܪܳܡܳܐ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !\n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܪܰܩܕܳܐ ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܪܩܰܕܽܘ... ܪܩܰܕܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !',
        pCredits: 'Eastern Lyrics:\n' +
            'ܬܹܐ ܡܘܿܢ ܡܛܲܐܠܲܚ ܠܲܡܛܲܐܲܠܬܵܐ ܕܪܸܩܕܵܐ! ܡܲܬܘܿܒ݂ܘܿܢ ܒܒܵܠܵܘܟ݂ܘܿܢ. ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ، ܒܟܵܠܝܼܬܘܿܢ! ܘܐܸܢ ܐܵܡܪܸܢ ܪܩܘܿܕܘܿܢ، ܒܪܵܩܕܝܼܬܘܿܢ!\n' +
            'ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܒܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ!\n' +
            'ܗܵܕܝܼܵܐ ܡܛܲܝܒ݂ܘܿܢ ܢܲܦ̮ܫܵܘܟ݂ܘܿܢ ܠܲܫܘܵܪܵܐ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܡ̣ܢ ܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ!\n' +
            'ܗܵܕܝܼܵܐ ܡܛܲܝܒ݂ܘܿܢ ܢܲܦ̮ܫܵܘܟ݂ܘܿܢ ܠܲܫܥܵܫܵܐ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܡ̣ܢ ܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ\n' +
            'ܗܵܕܝܼܵܐ ܡܛܲܝܒ݂ܘܿܢ ܢܲܦ̮ܫܵܘܟ݂ܘܿܢ ܠܲܦܬܵܠܵܐ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܡ̣ܢ ܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ\n' +
            'ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܒܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ!',
        pSubImages: SubSongsImagesListViewWidget(
            subImagesCount: subImagesURL.length,
            subImagesURL: subImagesURL,
            containerHeight: height * 1 / 4,
            imageWidth: width * 3 / 8,
            imageHeight: height * 3 / 16),
      ),
      SubSongsModel(
        pDescription:
            'Freeze Dance is a fun modern game song to engage kids and play them and have them move around, jump, shake, and dance. It has lots of benefits as it encourages kids to not be sitting for long time, thus helps their joins to be flexible; it is great for auditory processing and responding; it strengthens awareness and attention and body control; and it is a great way to improve balance whether static when stopping or dynamic when moving.',
        pFeatures: 'Western Lyrics:\n' +
            'ܬܳܟ̥ܽܘ ܡ݄ܫܬܰܥܺܝܢܰܐ ܗ̄ܽܘ ܫܽܘܥܝܳܐ ܕܽܗ̄ܘ ܪܰܩܕܳܐ ! ܡܰܚܶܬܽܘ ܒܒܳܠܰܝܟ̥ܽܘ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ، ܓ݄ܕܟܳܠܺܝܬܽܘ ! ܘܕܳܐܡܰܪ ܐ̱ܢܳܐ ܪܩܰܕܽܘ، ܓ݄ܕܪ݄ܩܕܺܝܬܽܘ ! \n' +
            'ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܪܩܰܕܽܘ... ܪܩܰܕܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ ! \n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܩܦܳܣܳܐ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !\n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܗܝܳܙܳܐ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !\n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܒܪܳܡܳܐ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !\n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܪܰܩܕܳܐ ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܪܩܰܕܽܘ... ܪܩܰܕܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !',
        pCredits: 'Eastern Lyrics:\n' +
            'ܬܹܐ ܡܘܿܢ ܡܛܲܐܠܲܚ ܠܲܡܛܲܐܲܠܬܵܐ ܕܪܸܩܕܵܐ! ܡܲܬܘܿܒ݂ܘܿܢ ܒܒܵܠܵܘܟ݂ܘܿܢ. ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ، ܒܟܵܠܝܼܬܘܿܢ! ܘܐܸܢ ܐܵܡܪܸܢ ܪܩܘܿܕܘܿܢ، ܒܪܵܩܕܝܼܬܘܿܢ!\n' +
            'ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܒܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ!\n' +
            'ܗܵܕܝܼܵܐ ܡܛܲܝܒ݂ܘܿܢ ܢܲܦ̮ܫܵܘܟ݂ܘܿܢ ܠܲܫܘܵܪܵܐ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܡ̣ܢ ܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ!\n' +
            'ܗܵܕܝܼܵܐ ܡܛܲܝܒ݂ܘܿܢ ܢܲܦ̮ܫܵܘܟ݂ܘܿܢ ܠܲܫܥܵܫܵܐ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܡ̣ܢ ܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ\n' +
            'ܗܵܕܝܼܵܐ ܡܛܲܝܒ݂ܘܿܢ ܢܲܦ̮ܫܵܘܟ݂ܘܿܢ ܠܲܦܬܵܠܵܐ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܡ̣ܢ ܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ\n' +
            'ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܒܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ!',
        pSubImages: SubSongsImagesListViewWidget(
            subImagesCount: subImagesURL.length,
            subImagesURL: subImagesURL,
            containerHeight: height * 1 / 4,
            imageWidth: width * 3 / 8,
            imageHeight: height * 3 / 16),
      ),
      SubSongsModel(
        pDescription:
            'Freeze Dance is a fun modern game song to engage kids and play them and have them move around, jump, shake, and dance. It has lots of benefits as it encourages kids to not be sitting for long time, thus helps their joins to be flexible; it is great for auditory processing and responding; it strengthens awareness and attention and body control; and it is a great way to improve balance whether static when stopping or dynamic when moving.',
        pFeatures: 'Western Lyrics:\n' +
            'ܬܳܟ̥ܽܘ ܡ݄ܫܬܰܥܺܝܢܰܐ ܗ̄ܽܘ ܫܽܘܥܝܳܐ ܕܽܗ̄ܘ ܪܰܩܕܳܐ ! ܡܰܚܶܬܽܘ ܒܒܳܠܰܝܟ̥ܽܘ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ، ܓ݄ܕܟܳܠܺܝܬܽܘ ! ܘܕܳܐܡܰܪ ܐ̱ܢܳܐ ܪܩܰܕܽܘ، ܓ݄ܕܪ݄ܩܕܺܝܬܽܘ ! \n' +
            'ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܪܩܰܕܽܘ... ܪܩܰܕܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ ! \n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܩܦܳܣܳܐ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !\n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܗܝܳܙܳܐ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !\n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܒܪܳܡܳܐ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !\n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܪܰܩܕܳܐ ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܪܩܰܕܽܘ... ܪܩܰܕܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !',
        pCredits: 'Eastern Lyrics:\n' +
            'ܬܹܐ ܡܘܿܢ ܡܛܲܐܠܲܚ ܠܲܡܛܲܐܲܠܬܵܐ ܕܪܸܩܕܵܐ! ܡܲܬܘܿܒ݂ܘܿܢ ܒܒܵܠܵܘܟ݂ܘܿܢ. ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ، ܒܟܵܠܝܼܬܘܿܢ! ܘܐܸܢ ܐܵܡܪܸܢ ܪܩܘܿܕܘܿܢ، ܒܪܵܩܕܝܼܬܘܿܢ!\n' +
            'ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܒܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ!\n' +
            'ܗܵܕܝܼܵܐ ܡܛܲܝܒ݂ܘܿܢ ܢܲܦ̮ܫܵܘܟ݂ܘܿܢ ܠܲܫܘܵܪܵܐ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܡ̣ܢ ܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ!\n' +
            'ܗܵܕܝܼܵܐ ܡܛܲܝܒ݂ܘܿܢ ܢܲܦ̮ܫܵܘܟ݂ܘܿܢ ܠܲܫܥܵܫܵܐ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܡ̣ܢ ܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ\n' +
            'ܗܵܕܝܼܵܐ ܡܛܲܝܒ݂ܘܿܢ ܢܲܦ̮ܫܵܘܟ݂ܘܿܢ ܠܲܦܬܵܠܵܐ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܡ̣ܢ ܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ\n' +
            'ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܒܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ!',
        pSubImages: SubSongsImagesListViewWidget(
            subImagesCount: subImagesURL.length,
            subImagesURL: subImagesURL,
            containerHeight: height * 1 / 4,
            imageWidth: width * 3 / 8,
            imageHeight: height * 3 / 16),
      ),
      SubSongsModel(
        pDescription:
            'Freeze Dance is a fun modern game song to engage kids and play them and have them move around, jump, shake, and dance. It has lots of benefits as it encourages kids to not be sitting for long time, thus helps their joins to be flexible; it is great for auditory processing and responding; it strengthens awareness and attention and body control; and it is a great way to improve balance whether static when stopping or dynamic when moving.',
        pFeatures: 'Western Lyrics:\n' +
            'ܬܳܟ̥ܽܘ ܡ݄ܫܬܰܥܺܝܢܰܐ ܗ̄ܽܘ ܫܽܘܥܝܳܐ ܕܽܗ̄ܘ ܪܰܩܕܳܐ ! ܡܰܚܶܬܽܘ ܒܒܳܠܰܝܟ̥ܽܘ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ، ܓ݄ܕܟܳܠܺܝܬܽܘ ! ܘܕܳܐܡܰܪ ܐ̱ܢܳܐ ܪܩܰܕܽܘ، ܓ݄ܕܪ݄ܩܕܺܝܬܽܘ ! \n' +
            'ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܪܩܰܕܽܘ... ܪܩܰܕܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ ! \n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܩܦܳܣܳܐ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !\n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܗܝܳܙܳܐ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !\n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܒܪܳܡܳܐ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !\n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܪܰܩܕܳܐ ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܪܩܰܕܽܘ... ܪܩܰܕܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !',
        pCredits: 'Eastern Lyrics:\n' +
            'ܬܹܐ ܡܘܿܢ ܡܛܲܐܠܲܚ ܠܲܡܛܲܐܲܠܬܵܐ ܕܪܸܩܕܵܐ! ܡܲܬܘܿܒ݂ܘܿܢ ܒܒܵܠܵܘܟ݂ܘܿܢ. ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ، ܒܟܵܠܝܼܬܘܿܢ! ܘܐܸܢ ܐܵܡܪܸܢ ܪܩܘܿܕܘܿܢ، ܒܪܵܩܕܝܼܬܘܿܢ!\n' +
            'ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܒܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ!\n' +
            'ܗܵܕܝܼܵܐ ܡܛܲܝܒ݂ܘܿܢ ܢܲܦ̮ܫܵܘܟ݂ܘܿܢ ܠܲܫܘܵܪܵܐ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܡ̣ܢ ܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ!\n' +
            'ܗܵܕܝܼܵܐ ܡܛܲܝܒ݂ܘܿܢ ܢܲܦ̮ܫܵܘܟ݂ܘܿܢ ܠܲܫܥܵܫܵܐ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܡ̣ܢ ܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ\n' +
            'ܗܵܕܝܼܵܐ ܡܛܲܝܒ݂ܘܿܢ ܢܲܦ̮ܫܵܘܟ݂ܘܿܢ ܠܲܦܬܵܠܵܐ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܡ̣ܢ ܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ\n' +
            'ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܒܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ!',
        pSubImages: SubSongsImagesListViewWidget(
            subImagesCount: subImagesURL.length,
            subImagesURL: subImagesURL,
            containerHeight: height * 1 / 4,
            imageWidth: width * 3 / 8,
            imageHeight: height * 3 / 16),
      ),
      SubSongsModel(
        pDescription:
            'Freeze Dance is a fun modern game song to engage kids and play them and have them move around, jump, shake, and dance. It has lots of benefits as it encourages kids to not be sitting for long time, thus helps their joins to be flexible; it is great for auditory processing and responding; it strengthens awareness and attention and body control; and it is a great way to improve balance whether static when stopping or dynamic when moving.',
        pFeatures: 'Western Lyrics:\n' +
            'ܬܳܟ̥ܽܘ ܡ݄ܫܬܰܥܺܝܢܰܐ ܗ̄ܽܘ ܫܽܘܥܝܳܐ ܕܽܗ̄ܘ ܪܰܩܕܳܐ ! ܡܰܚܶܬܽܘ ܒܒܳܠܰܝܟ̥ܽܘ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ، ܓ݄ܕܟܳܠܺܝܬܽܘ ! ܘܕܳܐܡܰܪ ܐ̱ܢܳܐ ܪܩܰܕܽܘ، ܓ݄ܕܪ݄ܩܕܺܝܬܽܘ ! \n' +
            'ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܪܩܰܕܽܘ... ܪܩܰܕܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ ! \n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܩܦܳܣܳܐ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !\n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܗܝܳܙܳܐ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !\n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܒܪܳܡܳܐ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !\n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܪܰܩܕܳܐ ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܪܩܰܕܽܘ... ܪܩܰܕܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !',
        pCredits: 'Eastern Lyrics:\n' +
            'ܬܹܐ ܡܘܿܢ ܡܛܲܐܠܲܚ ܠܲܡܛܲܐܲܠܬܵܐ ܕܪܸܩܕܵܐ! ܡܲܬܘܿܒ݂ܘܿܢ ܒܒܵܠܵܘܟ݂ܘܿܢ. ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ، ܒܟܵܠܝܼܬܘܿܢ! ܘܐܸܢ ܐܵܡܪܸܢ ܪܩܘܿܕܘܿܢ، ܒܪܵܩܕܝܼܬܘܿܢ!\n' +
            'ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܒܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ!\n' +
            'ܗܵܕܝܼܵܐ ܡܛܲܝܒ݂ܘܿܢ ܢܲܦ̮ܫܵܘܟ݂ܘܿܢ ܠܲܫܘܵܪܵܐ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܡ̣ܢ ܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ!\n' +
            'ܗܵܕܝܼܵܐ ܡܛܲܝܒ݂ܘܿܢ ܢܲܦ̮ܫܵܘܟ݂ܘܿܢ ܠܲܫܥܵܫܵܐ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܡ̣ܢ ܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ\n' +
            'ܗܵܕܝܼܵܐ ܡܛܲܝܒ݂ܘܿܢ ܢܲܦ̮ܫܵܘܟ݂ܘܿܢ ܠܲܦܬܵܠܵܐ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܡ̣ܢ ܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ\n' +
            'ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܒܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ!',
        pSubImages: SubSongsImagesListViewWidget(
            subImagesCount: subImagesURL.length,
            subImagesURL: subImagesURL,
            containerHeight: height * 1 / 4,
            imageWidth: width * 3 / 8,
            imageHeight: height * 3 / 16),
      ),
      SubSongsModel(
        pDescription:
            'Freeze Dance is a fun modern game song to engage kids and play them and have them move around, jump, shake, and dance. It has lots of benefits as it encourages kids to not be sitting for long time, thus helps their joins to be flexible; it is great for auditory processing and responding; it strengthens awareness and attention and body control; and it is a great way to improve balance whether static when stopping or dynamic when moving.',
        pFeatures: 'Western Lyrics:\n' +
            'ܬܳܟ̥ܽܘ ܡ݄ܫܬܰܥܺܝܢܰܐ ܗ̄ܽܘ ܫܽܘܥܝܳܐ ܕܽܗ̄ܘ ܪܰܩܕܳܐ ! ܡܰܚܶܬܽܘ ܒܒܳܠܰܝܟ̥ܽܘ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ، ܓ݄ܕܟܳܠܺܝܬܽܘ ! ܘܕܳܐܡܰܪ ܐ̱ܢܳܐ ܪܩܰܕܽܘ، ܓ݄ܕܪ݄ܩܕܺܝܬܽܘ ! \n' +
            'ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܪܩܰܕܽܘ... ܪܩܰܕܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ ! \n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܩܦܳܣܳܐ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !\n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܗܝܳܙܳܐ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !\n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܒܪܳܡܳܐ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !\n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܪܰܩܕܳܐ ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܪܩܰܕܽܘ... ܪܩܰܕܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !',
        pCredits: 'Eastern Lyrics:\n' +
            'ܬܹܐ ܡܘܿܢ ܡܛܲܐܠܲܚ ܠܲܡܛܲܐܲܠܬܵܐ ܕܪܸܩܕܵܐ! ܡܲܬܘܿܒ݂ܘܿܢ ܒܒܵܠܵܘܟ݂ܘܿܢ. ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ، ܒܟܵܠܝܼܬܘܿܢ! ܘܐܸܢ ܐܵܡܪܸܢ ܪܩܘܿܕܘܿܢ، ܒܪܵܩܕܝܼܬܘܿܢ!\n' +
            'ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܒܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ!\n' +
            'ܗܵܕܝܼܵܐ ܡܛܲܝܒ݂ܘܿܢ ܢܲܦ̮ܫܵܘܟ݂ܘܿܢ ܠܲܫܘܵܪܵܐ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܡ̣ܢ ܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ!\n' +
            'ܗܵܕܝܼܵܐ ܡܛܲܝܒ݂ܘܿܢ ܢܲܦ̮ܫܵܘܟ݂ܘܿܢ ܠܲܫܥܵܫܵܐ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܡ̣ܢ ܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ\n' +
            'ܗܵܕܝܼܵܐ ܡܛܲܝܒ݂ܘܿܢ ܢܲܦ̮ܫܵܘܟ݂ܘܿܢ ܠܲܦܬܵܠܵܐ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܡ̣ܢ ܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ\n' +
            'ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܒܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ!',
        pSubImages: SubSongsImagesListViewWidget(
            subImagesCount: subImagesURL.length,
            subImagesURL: subImagesURL,
            containerHeight: height * 1 / 4,
            imageWidth: width * 3 / 8,
            imageHeight: height * 3 / 16),
      ),

      SubSongsModel(
        pDescription:
            'Freeze Dance is a fun modern game song to engage kids and play them and have them move around, jump, shake, and dance. It has lots of benefits as it encourages kids to not be sitting for long time, thus helps their joins to be flexible; it is great for auditory processing and responding; it strengthens awareness and attention and body control; and it is a great way to improve balance whether static when stopping or dynamic when moving.',
        pFeatures: 'Western Lyrics:\n' +
            'ܬܳܟ̥ܽܘ ܡ݄ܫܬܰܥܺܝܢܰܐ ܗ̄ܽܘ ܫܽܘܥܝܳܐ ܕܽܗ̄ܘ ܪܰܩܕܳܐ ! ܡܰܚܶܬܽܘ ܒܒܳܠܰܝܟ̥ܽܘ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ، ܓ݄ܕܟܳܠܺܝܬܽܘ ! ܘܕܳܐܡܰܪ ܐ̱ܢܳܐ ܪܩܰܕܽܘ، ܓ݄ܕܪ݄ܩܕܺܝܬܽܘ ! \n' +
            'ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܪܩܰܕܽܘ... ܪܩܰܕܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ ! \n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܩܦܳܣܳܐ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !\n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܗܝܳܙܳܐ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !\n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܒܪܳܡܳܐ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !\n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܪܰܩܕܳܐ ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܪܩܰܕܽܘ... ܪܩܰܕܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !',
        pCredits: 'Eastern Lyrics:\n' +
            'ܬܹܐ ܡܘܿܢ ܡܛܲܐܠܲܚ ܠܲܡܛܲܐܲܠܬܵܐ ܕܪܸܩܕܵܐ! ܡܲܬܘܿܒ݂ܘܿܢ ܒܒܵܠܵܘܟ݂ܘܿܢ. ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ، ܒܟܵܠܝܼܬܘܿܢ! ܘܐܸܢ ܐܵܡܪܸܢ ܪܩܘܿܕܘܿܢ، ܒܪܵܩܕܝܼܬܘܿܢ!\n' +
            'ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܒܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ!\n' +
            'ܗܵܕܝܼܵܐ ܡܛܲܝܒ݂ܘܿܢ ܢܲܦ̮ܫܵܘܟ݂ܘܿܢ ܠܲܫܘܵܪܵܐ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܡ̣ܢ ܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ!\n' +
            'ܗܵܕܝܼܵܐ ܡܛܲܝܒ݂ܘܿܢ ܢܲܦ̮ܫܵܘܟ݂ܘܿܢ ܠܲܫܥܵܫܵܐ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܡ̣ܢ ܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ\n' +
            'ܗܵܕܝܼܵܐ ܡܛܲܝܒ݂ܘܿܢ ܢܲܦ̮ܫܵܘܟ݂ܘܿܢ ܠܲܦܬܵܠܵܐ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܡ̣ܢ ܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ\n' +
            'ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܒܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ!',
        pSubImages: SubSongsImagesListViewWidget(
            subImagesCount: subImagesURL.length,
            subImagesURL: subImagesURL,
            containerHeight: height * 1 / 4,
            imageWidth: width * 3 / 8,
            imageHeight: height * 3 / 16),
      ),
      SubSongsModel(
        pDescription:
            'Freeze Dance is a fun modern game song to engage kids and play them and have them move around, jump, shake, and dance. It has lots of benefits as it encourages kids to not be sitting for long time, thus helps their joins to be flexible; it is great for auditory processing and responding; it strengthens awareness and attention and body control; and it is a great way to improve balance whether static when stopping or dynamic when moving.',
        pFeatures: 'Western Lyrics:\n' +
            'ܬܳܟ̥ܽܘ ܡ݄ܫܬܰܥܺܝܢܰܐ ܗ̄ܽܘ ܫܽܘܥܝܳܐ ܕܽܗ̄ܘ ܪܰܩܕܳܐ ! ܡܰܚܶܬܽܘ ܒܒܳܠܰܝܟ̥ܽܘ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ، ܓ݄ܕܟܳܠܺܝܬܽܘ ! ܘܕܳܐܡܰܪ ܐ̱ܢܳܐ ܪܩܰܕܽܘ، ܓ݄ܕܪ݄ܩܕܺܝܬܽܘ ! \n' +
            'ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܪܩܰܕܽܘ... ܪܩܰܕܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ ! \n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܩܦܳܣܳܐ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !\n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܗܝܳܙܳܐ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !\n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܒܪܳܡܳܐ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !\n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܪܰܩܕܳܐ ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܪܩܰܕܽܘ... ܪܩܰܕܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !',
        pCredits: 'Eastern Lyrics:\n' +
            'ܬܹܐ ܡܘܿܢ ܡܛܲܐܠܲܚ ܠܲܡܛܲܐܲܠܬܵܐ ܕܪܸܩܕܵܐ! ܡܲܬܘܿܒ݂ܘܿܢ ܒܒܵܠܵܘܟ݂ܘܿܢ. ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ، ܒܟܵܠܝܼܬܘܿܢ! ܘܐܸܢ ܐܵܡܪܸܢ ܪܩܘܿܕܘܿܢ، ܒܪܵܩܕܝܼܬܘܿܢ!\n' +
            'ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܒܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ!\n' +
            'ܗܵܕܝܼܵܐ ܡܛܲܝܒ݂ܘܿܢ ܢܲܦ̮ܫܵܘܟ݂ܘܿܢ ܠܲܫܘܵܪܵܐ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܡ̣ܢ ܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ!\n' +
            'ܗܵܕܝܼܵܐ ܡܛܲܝܒ݂ܘܿܢ ܢܲܦ̮ܫܵܘܟ݂ܘܿܢ ܠܲܫܥܵܫܵܐ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܡ̣ܢ ܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ\n' +
            'ܗܵܕܝܼܵܐ ܡܛܲܝܒ݂ܘܿܢ ܢܲܦ̮ܫܵܘܟ݂ܘܿܢ ܠܲܦܬܵܠܵܐ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܡ̣ܢ ܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ\n' +
            'ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܒܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ!',
        pSubImages: SubSongsImagesListViewWidget(
            subImagesCount: subImagesURL.length,
            subImagesURL: subImagesURL,
            containerHeight: height * 1 / 4,
            imageWidth: width * 3 / 8,
            imageHeight: height * 3 / 16),
      ),
      SubSongsModel(
        pDescription:
            'Freeze Dance is a fun modern game song to engage kids and play them and have them move around, jump, shake, and dance. It has lots of benefits as it encourages kids to not be sitting for long time, thus helps their joins to be flexible; it is great for auditory processing and responding; it strengthens awareness and attention and body control; and it is a great way to improve balance whether static when stopping or dynamic when moving.',
        pFeatures: 'Western Lyrics:\n' +
            'ܬܳܟ̥ܽܘ ܡ݄ܫܬܰܥܺܝܢܰܐ ܗ̄ܽܘ ܫܽܘܥܝܳܐ ܕܽܗ̄ܘ ܪܰܩܕܳܐ ! ܡܰܚܶܬܽܘ ܒܒܳܠܰܝܟ̥ܽܘ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ، ܓ݄ܕܟܳܠܺܝܬܽܘ ! ܘܕܳܐܡܰܪ ܐ̱ܢܳܐ ܪܩܰܕܽܘ، ܓ݄ܕܪ݄ܩܕܺܝܬܽܘ ! \n' +
            'ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܪܩܰܕܽܘ... ܪܩܰܕܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ ! \n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܩܦܳܣܳܐ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !\n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܗܝܳܙܳܐ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !\n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܒܪܳܡܳܐ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !\n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܪܰܩܕܳܐ ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܪܩܰܕܽܘ... ܪܩܰܕܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !',
        pCredits: 'Eastern Lyrics:\n' +
            'ܬܹܐ ܡܘܿܢ ܡܛܲܐܠܲܚ ܠܲܡܛܲܐܲܠܬܵܐ ܕܪܸܩܕܵܐ! ܡܲܬܘܿܒ݂ܘܿܢ ܒܒܵܠܵܘܟ݂ܘܿܢ. ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ، ܒܟܵܠܝܼܬܘܿܢ! ܘܐܸܢ ܐܵܡܪܸܢ ܪܩܘܿܕܘܿܢ، ܒܪܵܩܕܝܼܬܘܿܢ!\n' +
            'ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܒܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ!\n' +
            'ܗܵܕܝܼܵܐ ܡܛܲܝܒ݂ܘܿܢ ܢܲܦ̮ܫܵܘܟ݂ܘܿܢ ܠܲܫܘܵܪܵܐ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܡ̣ܢ ܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ!\n' +
            'ܗܵܕܝܼܵܐ ܡܛܲܝܒ݂ܘܿܢ ܢܲܦ̮ܫܵܘܟ݂ܘܿܢ ܠܲܫܥܵܫܵܐ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܡ̣ܢ ܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ\n' +
            'ܗܵܕܝܼܵܐ ܡܛܲܝܒ݂ܘܿܢ ܢܲܦ̮ܫܵܘܟ݂ܘܿܢ ܠܲܦܬܵܠܵܐ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܡ̣ܢ ܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ\n' +
            'ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܒܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ!',
        pSubImages: SubSongsImagesListViewWidget(
            subImagesCount: subImagesURL.length,
            subImagesURL: subImagesURL,
            containerHeight: height * 1 / 4,
            imageWidth: width * 3 / 8,
            imageHeight: height * 3 / 16),
      ),
      SubSongsModel(
        pDescription:
            'Freeze Dance is a fun modern game song to engage kids and play them and have them move around, jump, shake, and dance. It has lots of benefits as it encourages kids to not be sitting for long time, thus helps their joins to be flexible; it is great for auditory processing and responding; it strengthens awareness and attention and body control; and it is a great way to improve balance whether static when stopping or dynamic when moving.',
        pFeatures: 'Western Lyrics:\n' +
            'ܬܳܟ̥ܽܘ ܡ݄ܫܬܰܥܺܝܢܰܐ ܗ̄ܽܘ ܫܽܘܥܝܳܐ ܕܽܗ̄ܘ ܪܰܩܕܳܐ ! ܡܰܚܶܬܽܘ ܒܒܳܠܰܝܟ̥ܽܘ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ، ܓ݄ܕܟܳܠܺܝܬܽܘ ! ܘܕܳܐܡܰܪ ܐ̱ܢܳܐ ܪܩܰܕܽܘ، ܓ݄ܕܪ݄ܩܕܺܝܬܽܘ ! \n' +
            'ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܪܩܰܕܽܘ... ܪܩܰܕܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ ! \n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܩܦܳܣܳܐ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !\n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܗܝܳܙܳܐ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !\n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܒܪܳܡܳܐ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !\n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܪܰܩܕܳܐ ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܪܩܰܕܽܘ... ܪܩܰܕܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !',
        pCredits: 'Eastern Lyrics:\n' +
            'ܬܹܐ ܡܘܿܢ ܡܛܲܐܠܲܚ ܠܲܡܛܲܐܲܠܬܵܐ ܕܪܸܩܕܵܐ! ܡܲܬܘܿܒ݂ܘܿܢ ܒܒܵܠܵܘܟ݂ܘܿܢ. ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ، ܒܟܵܠܝܼܬܘܿܢ! ܘܐܸܢ ܐܵܡܪܸܢ ܪܩܘܿܕܘܿܢ، ܒܪܵܩܕܝܼܬܘܿܢ!\n' +
            'ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܒܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ!\n' +
            'ܗܵܕܝܼܵܐ ܡܛܲܝܒ݂ܘܿܢ ܢܲܦ̮ܫܵܘܟ݂ܘܿܢ ܠܲܫܘܵܪܵܐ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܡ̣ܢ ܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ!\n' +
            'ܗܵܕܝܼܵܐ ܡܛܲܝܒ݂ܘܿܢ ܢܲܦ̮ܫܵܘܟ݂ܘܿܢ ܠܲܫܥܵܫܵܐ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܡ̣ܢ ܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ\n' +
            'ܗܵܕܝܼܵܐ ܡܛܲܝܒ݂ܘܿܢ ܢܲܦ̮ܫܵܘܟ݂ܘܿܢ ܠܲܦܬܵܠܵܐ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܡ̣ܢ ܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ\n' +
            'ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܒܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ!',
        pSubImages: SubSongsImagesListViewWidget(
            subImagesCount: subImagesURL.length,
            subImagesURL: subImagesURL,
            containerHeight: height * 1 / 4,
            imageWidth: width * 3 / 8,
            imageHeight: height * 3 / 16),
      ),
      SubSongsModel(
        pDescription:
            'Freeze Dance is a fun modern game song to engage kids and play them and have them move around, jump, shake, and dance. It has lots of benefits as it encourages kids to not be sitting for long time, thus helps their joins to be flexible; it is great for auditory processing and responding; it strengthens awareness and attention and body control; and it is a great way to improve balance whether static when stopping or dynamic when moving.',
        pFeatures: 'Western Lyrics:\n' +
            'ܬܳܟ̥ܽܘ ܡ݄ܫܬܰܥܺܝܢܰܐ ܗ̄ܽܘ ܫܽܘܥܝܳܐ ܕܽܗ̄ܘ ܪܰܩܕܳܐ ! ܡܰܚܶܬܽܘ ܒܒܳܠܰܝܟ̥ܽܘ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ، ܓ݄ܕܟܳܠܺܝܬܽܘ ! ܘܕܳܐܡܰܪ ܐ̱ܢܳܐ ܪܩܰܕܽܘ، ܓ݄ܕܪ݄ܩܕܺܝܬܽܘ ! \n' +
            'ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܪܩܰܕܽܘ... ܪܩܰܕܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ ! \n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܩܦܳܣܳܐ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !\n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܗܝܳܙܳܐ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !\n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܒܪܳܡܳܐ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !\n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܪܰܩܕܳܐ ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܪܩܰܕܽܘ... ܪܩܰܕܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !',
        pCredits: 'Eastern Lyrics:\n' +
            'ܬܹܐ ܡܘܿܢ ܡܛܲܐܠܲܚ ܠܲܡܛܲܐܲܠܬܵܐ ܕܪܸܩܕܵܐ! ܡܲܬܘܿܒ݂ܘܿܢ ܒܒܵܠܵܘܟ݂ܘܿܢ. ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ، ܒܟܵܠܝܼܬܘܿܢ! ܘܐܸܢ ܐܵܡܪܸܢ ܪܩܘܿܕܘܿܢ، ܒܪܵܩܕܝܼܬܘܿܢ!\n' +
            'ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܒܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ!\n' +
            'ܗܵܕܝܼܵܐ ܡܛܲܝܒ݂ܘܿܢ ܢܲܦ̮ܫܵܘܟ݂ܘܿܢ ܠܲܫܘܵܪܵܐ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܡ̣ܢ ܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ!\n' +
            'ܗܵܕܝܼܵܐ ܡܛܲܝܒ݂ܘܿܢ ܢܲܦ̮ܫܵܘܟ݂ܘܿܢ ܠܲܫܥܵܫܵܐ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܡ̣ܢ ܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ\n' +
            'ܗܵܕܝܼܵܐ ܡܛܲܝܒ݂ܘܿܢ ܢܲܦ̮ܫܵܘܟ݂ܘܿܢ ܠܲܦܬܵܠܵܐ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܡ̣ܢ ܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ\n' +
            'ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܒܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ!',
        pSubImages: SubSongsImagesListViewWidget(
            subImagesCount: subImagesURL.length,
            subImagesURL: subImagesURL,
            containerHeight: height * 1 / 4,
            imageWidth: width * 3 / 8,
            imageHeight: height * 3 / 16),
      ),
      SubSongsModel(
        pDescription:
            'Freeze Dance is a fun modern game song to engage kids and play them and have them move around, jump, shake, and dance. It has lots of benefits as it encourages kids to not be sitting for long time, thus helps their joins to be flexible; it is great for auditory processing and responding; it strengthens awareness and attention and body control; and it is a great way to improve balance whether static when stopping or dynamic when moving.',
        pFeatures: 'Western Lyrics:\n' +
            'ܬܳܟ̥ܽܘ ܡ݄ܫܬܰܥܺܝܢܰܐ ܗ̄ܽܘ ܫܽܘܥܝܳܐ ܕܽܗ̄ܘ ܪܰܩܕܳܐ ! ܡܰܚܶܬܽܘ ܒܒܳܠܰܝܟ̥ܽܘ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ، ܓ݄ܕܟܳܠܺܝܬܽܘ ! ܘܕܳܐܡܰܪ ܐ̱ܢܳܐ ܪܩܰܕܽܘ، ܓ݄ܕܪ݄ܩܕܺܝܬܽܘ ! \n' +
            'ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܪܩܰܕܽܘ... ܪܩܰܕܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ ! \n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܩܦܳܣܳܐ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !\n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܗܝܳܙܳܐ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !\n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܒܪܳܡܳܐ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !\n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܪܰܩܕܳܐ ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܪܩܰܕܽܘ... ܪܩܰܕܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !',
        pCredits: 'Eastern Lyrics:\n' +
            'ܬܹܐ ܡܘܿܢ ܡܛܲܐܠܲܚ ܠܲܡܛܲܐܲܠܬܵܐ ܕܪܸܩܕܵܐ! ܡܲܬܘܿܒ݂ܘܿܢ ܒܒܵܠܵܘܟ݂ܘܿܢ. ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ، ܒܟܵܠܝܼܬܘܿܢ! ܘܐܸܢ ܐܵܡܪܸܢ ܪܩܘܿܕܘܿܢ، ܒܪܵܩܕܝܼܬܘܿܢ!\n' +
            'ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܒܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ!\n' +
            'ܗܵܕܝܼܵܐ ܡܛܲܝܒ݂ܘܿܢ ܢܲܦ̮ܫܵܘܟ݂ܘܿܢ ܠܲܫܘܵܪܵܐ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܡ̣ܢ ܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ!\n' +
            'ܗܵܕܝܼܵܐ ܡܛܲܝܒ݂ܘܿܢ ܢܲܦ̮ܫܵܘܟ݂ܘܿܢ ܠܲܫܥܵܫܵܐ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܡ̣ܢ ܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ\n' +
            'ܗܵܕܝܼܵܐ ܡܛܲܝܒ݂ܘܿܢ ܢܲܦ̮ܫܵܘܟ݂ܘܿܢ ܠܲܦܬܵܠܵܐ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܡ̣ܢ ܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ\n' +
            'ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܒܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ!',
        pSubImages: SubSongsImagesListViewWidget(
            subImagesCount: subImagesURL.length,
            subImagesURL: subImagesURL,
            containerHeight: height * 1 / 4,
            imageWidth: width * 3 / 8,
            imageHeight: height * 3 / 16),
      ),
      SubSongsModel(
        pDescription:
            'Freeze Dance is a fun modern game song to engage kids and play them and have them move around, jump, shake, and dance. It has lots of benefits as it encourages kids to not be sitting for long time, thus helps their joins to be flexible; it is great for auditory processing and responding; it strengthens awareness and attention and body control; and it is a great way to improve balance whether static when stopping or dynamic when moving.',
        pFeatures: 'Western Lyrics:\n' +
            'ܬܳܟ̥ܽܘ ܡ݄ܫܬܰܥܺܝܢܰܐ ܗ̄ܽܘ ܫܽܘܥܝܳܐ ܕܽܗ̄ܘ ܪܰܩܕܳܐ ! ܡܰܚܶܬܽܘ ܒܒܳܠܰܝܟ̥ܽܘ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ، ܓ݄ܕܟܳܠܺܝܬܽܘ ! ܘܕܳܐܡܰܪ ܐ̱ܢܳܐ ܪܩܰܕܽܘ، ܓ݄ܕܪ݄ܩܕܺܝܬܽܘ ! \n' +
            'ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܪܩܰܕܽܘ... ܪܩܰܕܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ ! \n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܩܦܳܣܳܐ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !\n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܗܝܳܙܳܐ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !\n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܒܪܳܡܳܐ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !\n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܪܰܩܕܳܐ ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܪܩܰܕܽܘ... ܪܩܰܕܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !',
        pCredits: 'Eastern Lyrics:\n' +
            'ܬܹܐ ܡܘܿܢ ܡܛܲܐܠܲܚ ܠܲܡܛܲܐܲܠܬܵܐ ܕܪܸܩܕܵܐ! ܡܲܬܘܿܒ݂ܘܿܢ ܒܒܵܠܵܘܟ݂ܘܿܢ. ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ، ܒܟܵܠܝܼܬܘܿܢ! ܘܐܸܢ ܐܵܡܪܸܢ ܪܩܘܿܕܘܿܢ، ܒܪܵܩܕܝܼܬܘܿܢ!\n' +
            'ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܒܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ!\n' +
            'ܗܵܕܝܼܵܐ ܡܛܲܝܒ݂ܘܿܢ ܢܲܦ̮ܫܵܘܟ݂ܘܿܢ ܠܲܫܘܵܪܵܐ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܡ̣ܢ ܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ!\n' +
            'ܗܵܕܝܼܵܐ ܡܛܲܝܒ݂ܘܿܢ ܢܲܦ̮ܫܵܘܟ݂ܘܿܢ ܠܲܫܥܵܫܵܐ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܡ̣ܢ ܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ\n' +
            'ܗܵܕܝܼܵܐ ܡܛܲܝܒ݂ܘܿܢ ܢܲܦ̮ܫܵܘܟ݂ܘܿܢ ܠܲܦܬܵܠܵܐ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܡ̣ܢ ܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ\n' +
            'ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܒܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ!',
        pSubImages: SubSongsImagesListViewWidget(
            subImagesCount: subImagesURL.length,
            subImagesURL: subImagesURL,
            containerHeight: height * 1 / 4,
            imageWidth: width * 3 / 8,
            imageHeight: height * 3 / 16),
      ),
      SubSongsModel(
        pDescription:
            'Freeze Dance is a fun modern game song to engage kids and play them and have them move around, jump, shake, and dance. It has lots of benefits as it encourages kids to not be sitting for long time, thus helps their joins to be flexible; it is great for auditory processing and responding; it strengthens awareness and attention and body control; and it is a great way to improve balance whether static when stopping or dynamic when moving.',
        pFeatures: 'Western Lyrics:\n' +
            'ܬܳܟ̥ܽܘ ܡ݄ܫܬܰܥܺܝܢܰܐ ܗ̄ܽܘ ܫܽܘܥܝܳܐ ܕܽܗ̄ܘ ܪܰܩܕܳܐ ! ܡܰܚܶܬܽܘ ܒܒܳܠܰܝܟ̥ܽܘ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ، ܓ݄ܕܟܳܠܺܝܬܽܘ ! ܘܕܳܐܡܰܪ ܐ̱ܢܳܐ ܪܩܰܕܽܘ، ܓ݄ܕܪ݄ܩܕܺܝܬܽܘ ! \n' +
            'ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܪܩܰܕܽܘ... ܪܩܰܕܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ ! \n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܩܦܳܣܳܐ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !\n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܗܝܳܙܳܐ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !\n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܒܪܳܡܳܐ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !\n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܪܰܩܕܳܐ ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܪܩܰܕܽܘ... ܪܩܰܕܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !',
        pCredits: 'Eastern Lyrics:\n' +
            'ܬܹܐ ܡܘܿܢ ܡܛܲܐܠܲܚ ܠܲܡܛܲܐܲܠܬܵܐ ܕܪܸܩܕܵܐ! ܡܲܬܘܿܒ݂ܘܿܢ ܒܒܵܠܵܘܟ݂ܘܿܢ. ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ، ܒܟܵܠܝܼܬܘܿܢ! ܘܐܸܢ ܐܵܡܪܸܢ ܪܩܘܿܕܘܿܢ، ܒܪܵܩܕܝܼܬܘܿܢ!\n' +
            'ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܒܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ!\n' +
            'ܗܵܕܝܼܵܐ ܡܛܲܝܒ݂ܘܿܢ ܢܲܦ̮ܫܵܘܟ݂ܘܿܢ ܠܲܫܘܵܪܵܐ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܡ̣ܢ ܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ!\n' +
            'ܗܵܕܝܼܵܐ ܡܛܲܝܒ݂ܘܿܢ ܢܲܦ̮ܫܵܘܟ݂ܘܿܢ ܠܲܫܥܵܫܵܐ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܡ̣ܢ ܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ\n' +
            'ܗܵܕܝܼܵܐ ܡܛܲܝܒ݂ܘܿܢ ܢܲܦ̮ܫܵܘܟ݂ܘܿܢ ܠܲܦܬܵܠܵܐ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܡ̣ܢ ܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ\n' +
            'ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܒܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ!',
        pSubImages: SubSongsImagesListViewWidget(
            subImagesCount: subImagesURL.length,
            subImagesURL: subImagesURL,
            containerHeight: height * 1 / 4,
            imageWidth: width * 3 / 8,
            imageHeight: height * 3 / 16),
      ),
      SubSongsModel(
        pDescription:
            'Freeze Dance is a fun modern game song to engage kids and play them and have them move around, jump, shake, and dance. It has lots of benefits as it encourages kids to not be sitting for long time, thus helps their joins to be flexible; it is great for auditory processing and responding; it strengthens awareness and attention and body control; and it is a great way to improve balance whether static when stopping or dynamic when moving.',
        pFeatures: 'Western Lyrics:\n' +
            'ܬܳܟ̥ܽܘ ܡ݄ܫܬܰܥܺܝܢܰܐ ܗ̄ܽܘ ܫܽܘܥܝܳܐ ܕܽܗ̄ܘ ܪܰܩܕܳܐ ! ܡܰܚܶܬܽܘ ܒܒܳܠܰܝܟ̥ܽܘ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ، ܓ݄ܕܟܳܠܺܝܬܽܘ ! ܘܕܳܐܡܰܪ ܐ̱ܢܳܐ ܪܩܰܕܽܘ، ܓ݄ܕܪ݄ܩܕܺܝܬܽܘ ! \n' +
            'ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܪܩܰܕܽܘ... ܪܩܰܕܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ ! \n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܩܦܳܣܳܐ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !\n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܗܝܳܙܳܐ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !\n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܒܪܳܡܳܐ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !\n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܪܰܩܕܳܐ ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܪܩܰܕܽܘ... ܪܩܰܕܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !',
        pCredits: 'Eastern Lyrics:\n' +
            'ܬܹܐ ܡܘܿܢ ܡܛܲܐܠܲܚ ܠܲܡܛܲܐܲܠܬܵܐ ܕܪܸܩܕܵܐ! ܡܲܬܘܿܒ݂ܘܿܢ ܒܒܵܠܵܘܟ݂ܘܿܢ. ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ، ܒܟܵܠܝܼܬܘܿܢ! ܘܐܸܢ ܐܵܡܪܸܢ ܪܩܘܿܕܘܿܢ، ܒܪܵܩܕܝܼܬܘܿܢ!\n' +
            'ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܒܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ!\n' +
            'ܗܵܕܝܼܵܐ ܡܛܲܝܒ݂ܘܿܢ ܢܲܦ̮ܫܵܘܟ݂ܘܿܢ ܠܲܫܘܵܪܵܐ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܡ̣ܢ ܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ!\n' +
            'ܗܵܕܝܼܵܐ ܡܛܲܝܒ݂ܘܿܢ ܢܲܦ̮ܫܵܘܟ݂ܘܿܢ ܠܲܫܥܵܫܵܐ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܡ̣ܢ ܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ\n' +
            'ܗܵܕܝܼܵܐ ܡܛܲܝܒ݂ܘܿܢ ܢܲܦ̮ܫܵܘܟ݂ܘܿܢ ܠܲܦܬܵܠܵܐ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܡ̣ܢ ܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ\n' +
            'ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܒܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ!',
        pSubImages: SubSongsImagesListViewWidget(
            subImagesCount: subImagesURL.length,
            subImagesURL: subImagesURL,
            containerHeight: height * 1 / 4,
            imageWidth: width * 3 / 8,
            imageHeight: height * 3 / 16),
      ),
      SubSongsModel(
        pDescription:
            'Freeze Dance is a fun modern game song to engage kids and play them and have them move around, jump, shake, and dance. It has lots of benefits as it encourages kids to not be sitting for long time, thus helps their joins to be flexible; it is great for auditory processing and responding; it strengthens awareness and attention and body control; and it is a great way to improve balance whether static when stopping or dynamic when moving.',
        pFeatures: 'Western Lyrics:\n' +
            'ܬܳܟ̥ܽܘ ܡ݄ܫܬܰܥܺܝܢܰܐ ܗ̄ܽܘ ܫܽܘܥܝܳܐ ܕܽܗ̄ܘ ܪܰܩܕܳܐ ! ܡܰܚܶܬܽܘ ܒܒܳܠܰܝܟ̥ܽܘ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ، ܓ݄ܕܟܳܠܺܝܬܽܘ ! ܘܕܳܐܡܰܪ ܐ̱ܢܳܐ ܪܩܰܕܽܘ، ܓ݄ܕܪ݄ܩܕܺܝܬܽܘ ! \n' +
            'ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܪܩܰܕܽܘ... ܪܩܰܕܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ ! \n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܩܦܳܣܳܐ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !\n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܗܝܳܙܳܐ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !\n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܒܪܳܡܳܐ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !\n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܪܰܩܕܳܐ ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܪܩܰܕܽܘ... ܪܩܰܕܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !',
        pCredits: 'Eastern Lyrics:\n' +
            'ܬܹܐ ܡܘܿܢ ܡܛܲܐܠܲܚ ܠܲܡܛܲܐܲܠܬܵܐ ܕܪܸܩܕܵܐ! ܡܲܬܘܿܒ݂ܘܿܢ ܒܒܵܠܵܘܟ݂ܘܿܢ. ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ، ܒܟܵܠܝܼܬܘܿܢ! ܘܐܸܢ ܐܵܡܪܸܢ ܪܩܘܿܕܘܿܢ، ܒܪܵܩܕܝܼܬܘܿܢ!\n' +
            'ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܒܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ!\n' +
            'ܗܵܕܝܼܵܐ ܡܛܲܝܒ݂ܘܿܢ ܢܲܦ̮ܫܵܘܟ݂ܘܿܢ ܠܲܫܘܵܪܵܐ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܡ̣ܢ ܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ!\n' +
            'ܗܵܕܝܼܵܐ ܡܛܲܝܒ݂ܘܿܢ ܢܲܦ̮ܫܵܘܟ݂ܘܿܢ ܠܲܫܥܵܫܵܐ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܡ̣ܢ ܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ\n' +
            'ܗܵܕܝܼܵܐ ܡܛܲܝܒ݂ܘܿܢ ܢܲܦ̮ܫܵܘܟ݂ܘܿܢ ܠܲܦܬܵܠܵܐ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܡ̣ܢ ܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ\n' +
            'ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܒܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ!',
        pSubImages: SubSongsImagesListViewWidget(
            subImagesCount: subImagesURL.length,
            subImagesURL: subImagesURL,
            containerHeight: height * 1 / 4,
            imageWidth: width * 3 / 8,
            imageHeight: height * 3 / 16),
      ),
      SubSongsModel(
        pDescription:
            'Freeze Dance is a fun modern game song to engage kids and play them and have them move around, jump, shake, and dance. It has lots of benefits as it encourages kids to not be sitting for long time, thus helps their joins to be flexible; it is great for auditory processing and responding; it strengthens awareness and attention and body control; and it is a great way to improve balance whether static when stopping or dynamic when moving.',
        pFeatures: 'Western Lyrics:\n' +
            'ܬܳܟ̥ܽܘ ܡ݄ܫܬܰܥܺܝܢܰܐ ܗ̄ܽܘ ܫܽܘܥܝܳܐ ܕܽܗ̄ܘ ܪܰܩܕܳܐ ! ܡܰܚܶܬܽܘ ܒܒܳܠܰܝܟ̥ܽܘ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ، ܓ݄ܕܟܳܠܺܝܬܽܘ ! ܘܕܳܐܡܰܪ ܐ̱ܢܳܐ ܪܩܰܕܽܘ، ܓ݄ܕܪ݄ܩܕܺܝܬܽܘ ! \n' +
            'ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܪܩܰܕܽܘ... ܪܩܰܕܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ ! \n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܩܦܳܣܳܐ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !\n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܗܝܳܙܳܐ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !\n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܒܪܳܡܳܐ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !\n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܪܰܩܕܳܐ ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܪܩܰܕܽܘ... ܪܩܰܕܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !',
        pCredits: 'Eastern Lyrics:\n' +
            'ܬܹܐ ܡܘܿܢ ܡܛܲܐܠܲܚ ܠܲܡܛܲܐܲܠܬܵܐ ܕܪܸܩܕܵܐ! ܡܲܬܘܿܒ݂ܘܿܢ ܒܒܵܠܵܘܟ݂ܘܿܢ. ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ، ܒܟܵܠܝܼܬܘܿܢ! ܘܐܸܢ ܐܵܡܪܸܢ ܪܩܘܿܕܘܿܢ، ܒܪܵܩܕܝܼܬܘܿܢ!\n' +
            'ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܒܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ!\n' +
            'ܗܵܕܝܼܵܐ ܡܛܲܝܒ݂ܘܿܢ ܢܲܦ̮ܫܵܘܟ݂ܘܿܢ ܠܲܫܘܵܪܵܐ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܡ̣ܢ ܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ!\n' +
            'ܗܵܕܝܼܵܐ ܡܛܲܝܒ݂ܘܿܢ ܢܲܦ̮ܫܵܘܟ݂ܘܿܢ ܠܲܫܥܵܫܵܐ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܡ̣ܢ ܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ\n' +
            'ܗܵܕܝܼܵܐ ܡܛܲܝܒ݂ܘܿܢ ܢܲܦ̮ܫܵܘܟ݂ܘܿܢ ܠܲܦܬܵܠܵܐ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܡ̣ܢ ܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ\n' +
            'ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܒܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ!',
        pSubImages: SubSongsImagesListViewWidget(
            subImagesCount: subImagesURL.length,
            subImagesURL: subImagesURL,
            containerHeight: height * 1 / 4,
            imageWidth: width * 3 / 8,
            imageHeight: height * 3 / 16),
      ),
      SubSongsModel(
        pDescription:
            'Freeze Dance is a fun modern game song to engage kids and play them and have them move around, jump, shake, and dance. It has lots of benefits as it encourages kids to not be sitting for long time, thus helps their joins to be flexible; it is great for auditory processing and responding; it strengthens awareness and attention and body control; and it is a great way to improve balance whether static when stopping or dynamic when moving.',
        pFeatures: 'Western Lyrics:\n' +
            'ܬܳܟ̥ܽܘ ܡ݄ܫܬܰܥܺܝܢܰܐ ܗ̄ܽܘ ܫܽܘܥܝܳܐ ܕܽܗ̄ܘ ܪܰܩܕܳܐ ! ܡܰܚܶܬܽܘ ܒܒܳܠܰܝܟ̥ܽܘ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ، ܓ݄ܕܟܳܠܺܝܬܽܘ ! ܘܕܳܐܡܰܪ ܐ̱ܢܳܐ ܪܩܰܕܽܘ، ܓ݄ܕܪ݄ܩܕܺܝܬܽܘ ! \n' +
            'ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܪܩܰܕܽܘ... ܪܩܰܕܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ ! \n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܩܦܳܣܳܐ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !\n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܗܝܳܙܳܐ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !\n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܒܪܳܡܳܐ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !\n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܪܰܩܕܳܐ ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܪܩܰܕܽܘ... ܪܩܰܕܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !',
        pCredits: 'Eastern Lyrics:\n' +
            'ܬܹܐ ܡܘܿܢ ܡܛܲܐܠܲܚ ܠܲܡܛܲܐܲܠܬܵܐ ܕܪܸܩܕܵܐ! ܡܲܬܘܿܒ݂ܘܿܢ ܒܒܵܠܵܘܟ݂ܘܿܢ. ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ، ܒܟܵܠܝܼܬܘܿܢ! ܘܐܸܢ ܐܵܡܪܸܢ ܪܩܘܿܕܘܿܢ، ܒܪܵܩܕܝܼܬܘܿܢ!\n' +
            'ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܒܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ!\n' +
            'ܗܵܕܝܼܵܐ ܡܛܲܝܒ݂ܘܿܢ ܢܲܦ̮ܫܵܘܟ݂ܘܿܢ ܠܲܫܘܵܪܵܐ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܡ̣ܢ ܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ!\n' +
            'ܗܵܕܝܼܵܐ ܡܛܲܝܒ݂ܘܿܢ ܢܲܦ̮ܫܵܘܟ݂ܘܿܢ ܠܲܫܥܵܫܵܐ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܡ̣ܢ ܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ\n' +
            'ܗܵܕܝܼܵܐ ܡܛܲܝܒ݂ܘܿܢ ܢܲܦ̮ܫܵܘܟ݂ܘܿܢ ܠܲܦܬܵܠܵܐ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܡ̣ܢ ܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ\n' +
            'ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܒܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ!',
        pSubImages: SubSongsImagesListViewWidget(
            subImagesCount: subImagesURL.length,
            subImagesURL: subImagesURL,
            containerHeight: height * 1 / 4,
            imageWidth: width * 3 / 8,
            imageHeight: height * 3 / 16),
      ),
      SubSongsModel(
        pDescription:
            'Freeze Dance is a fun modern game song to engage kids and play them and have them move around, jump, shake, and dance. It has lots of benefits as it encourages kids to not be sitting for long time, thus helps their joins to be flexible; it is great for auditory processing and responding; it strengthens awareness and attention and body control; and it is a great way to improve balance whether static when stopping or dynamic when moving.',
        pFeatures: 'Western Lyrics:\n' +
            'ܬܳܟ̥ܽܘ ܡ݄ܫܬܰܥܺܝܢܰܐ ܗ̄ܽܘ ܫܽܘܥܝܳܐ ܕܽܗ̄ܘ ܪܰܩܕܳܐ ! ܡܰܚܶܬܽܘ ܒܒܳܠܰܝܟ̥ܽܘ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ، ܓ݄ܕܟܳܠܺܝܬܽܘ ! ܘܕܳܐܡܰܪ ܐ̱ܢܳܐ ܪܩܰܕܽܘ، ܓ݄ܕܪ݄ܩܕܺܝܬܽܘ ! \n' +
            'ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܪܩܰܕܽܘ... ܪܩܰܕܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ ! \n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܩܦܳܣܳܐ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !\n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܗܝܳܙܳܐ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !\n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܒܪܳܡܳܐ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !\n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܪܰܩܕܳܐ ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܪܩܰܕܽܘ... ܪܩܰܕܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !',
        pCredits: 'Eastern Lyrics:\n' +
            'ܬܹܐ ܡܘܿܢ ܡܛܲܐܠܲܚ ܠܲܡܛܲܐܲܠܬܵܐ ܕܪܸܩܕܵܐ! ܡܲܬܘܿܒ݂ܘܿܢ ܒܒܵܠܵܘܟ݂ܘܿܢ. ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ، ܒܟܵܠܝܼܬܘܿܢ! ܘܐܸܢ ܐܵܡܪܸܢ ܪܩܘܿܕܘܿܢ، ܒܪܵܩܕܝܼܬܘܿܢ!\n' +
            'ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܒܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ!\n' +
            'ܗܵܕܝܼܵܐ ܡܛܲܝܒ݂ܘܿܢ ܢܲܦ̮ܫܵܘܟ݂ܘܿܢ ܠܲܫܘܵܪܵܐ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܡ̣ܢ ܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ!\n' +
            'ܗܵܕܝܼܵܐ ܡܛܲܝܒ݂ܘܿܢ ܢܲܦ̮ܫܵܘܟ݂ܘܿܢ ܠܲܫܥܵܫܵܐ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܡ̣ܢ ܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ\n' +
            'ܗܵܕܝܼܵܐ ܡܛܲܝܒ݂ܘܿܢ ܢܲܦ̮ܫܵܘܟ݂ܘܿܢ ܠܲܦܬܵܠܵܐ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܡ̣ܢ ܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ\n' +
            'ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܒܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ!',
        pSubImages: SubSongsImagesListViewWidget(
            subImagesCount: subImagesURL.length,
            subImagesURL: subImagesURL,
            containerHeight: height * 1 / 4,
            imageWidth: width * 3 / 8,
            imageHeight: height * 3 / 16),
      ),
      SubSongsModel(
        pDescription:
            'Freeze Dance is a fun modern game song to engage kids and play them and have them move around, jump, shake, and dance. It has lots of benefits as it encourages kids to not be sitting for long time, thus helps their joins to be flexible; it is great for auditory processing and responding; it strengthens awareness and attention and body control; and it is a great way to improve balance whether static when stopping or dynamic when moving.',
        pFeatures: 'Western Lyrics:\n' +
            'ܬܳܟ̥ܽܘ ܡ݄ܫܬܰܥܺܝܢܰܐ ܗ̄ܽܘ ܫܽܘܥܝܳܐ ܕܽܗ̄ܘ ܪܰܩܕܳܐ ! ܡܰܚܶܬܽܘ ܒܒܳܠܰܝܟ̥ܽܘ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ، ܓ݄ܕܟܳܠܺܝܬܽܘ ! ܘܕܳܐܡܰܪ ܐ̱ܢܳܐ ܪܩܰܕܽܘ، ܓ݄ܕܪ݄ܩܕܺܝܬܽܘ ! \n' +
            'ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܪܩܰܕܽܘ... ܪܩܰܕܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ ! \n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܩܦܳܣܳܐ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !\n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܗܝܳܙܳܐ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !\n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܒܪܳܡܳܐ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !\n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܪܰܩܕܳܐ ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܪܩܰܕܽܘ... ܪܩܰܕܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !',
        pCredits: 'Eastern Lyrics:\n' +
            'ܬܹܐ ܡܘܿܢ ܡܛܲܐܠܲܚ ܠܲܡܛܲܐܲܠܬܵܐ ܕܪܸܩܕܵܐ! ܡܲܬܘܿܒ݂ܘܿܢ ܒܒܵܠܵܘܟ݂ܘܿܢ. ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ، ܒܟܵܠܝܼܬܘܿܢ! ܘܐܸܢ ܐܵܡܪܸܢ ܪܩܘܿܕܘܿܢ، ܒܪܵܩܕܝܼܬܘܿܢ!\n' +
            'ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܒܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ!\n' +
            'ܗܵܕܝܼܵܐ ܡܛܲܝܒ݂ܘܿܢ ܢܲܦ̮ܫܵܘܟ݂ܘܿܢ ܠܲܫܘܵܪܵܐ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܡ̣ܢ ܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ!\n' +
            'ܗܵܕܝܼܵܐ ܡܛܲܝܒ݂ܘܿܢ ܢܲܦ̮ܫܵܘܟ݂ܘܿܢ ܠܲܫܥܵܫܵܐ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܡ̣ܢ ܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ\n' +
            'ܗܵܕܝܼܵܐ ܡܛܲܝܒ݂ܘܿܢ ܢܲܦ̮ܫܵܘܟ݂ܘܿܢ ܠܲܦܬܵܠܵܐ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܡ̣ܢ ܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ\n' +
            'ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܒܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ!',
        pSubImages: SubSongsImagesListViewWidget(
            subImagesCount: subImagesURL.length,
            subImagesURL: subImagesURL,
            containerHeight: height * 1 / 4,
            imageWidth: width * 3 / 8,
            imageHeight: height * 3 / 16),
      ),
      SubSongsModel(
        pDescription:
            'Freeze Dance is a fun modern game song to engage kids and play them and have them move around, jump, shake, and dance. It has lots of benefits as it encourages kids to not be sitting for long time, thus helps their joins to be flexible; it is great for auditory processing and responding; it strengthens awareness and attention and body control; and it is a great way to improve balance whether static when stopping or dynamic when moving.',
        pFeatures: 'Western Lyrics:\n' +
            'ܬܳܟ̥ܽܘ ܡ݄ܫܬܰܥܺܝܢܰܐ ܗ̄ܽܘ ܫܽܘܥܝܳܐ ܕܽܗ̄ܘ ܪܰܩܕܳܐ ! ܡܰܚܶܬܽܘ ܒܒܳܠܰܝܟ̥ܽܘ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ، ܓ݄ܕܟܳܠܺܝܬܽܘ ! ܘܕܳܐܡܰܪ ܐ̱ܢܳܐ ܪܩܰܕܽܘ، ܓ݄ܕܪ݄ܩܕܺܝܬܽܘ ! \n' +
            'ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܪܩܰܕܽܘ... ܪܩܰܕܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ ! \n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܩܦܳܣܳܐ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܩܦܰܣܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !\n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܗܝܳܙܳܐ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܗܽܘܙܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !\n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܒܪܳܡܳܐ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܒܪܰܡܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !\n' +
            'ܐܽܘܥܕܳܐ ܡܛܰܝܶܒܽܘ ܪܽܘܚܰܝܟ̥ܽܘ ܠܽܗ̄ܘ ܪܰܩܕܳܐ ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܒܗ̄ܝ ܚܳܠܳܐ ܪܩܰܕܽܘ ܪܩܰܕܽܘ ܪܩܰܕܽܘ... ܪܩܰܕܽܘ ܡܶܢ̱ ܟܽܘܠ ܠܶܒܰܝܟ̥ܽܘ... ܟܠܰܝܽܘ ܢܰܩܠܰܐ ܕܕܐܡܳܪ̄ ܐ̱ܢܳܐ ܟܠܰܝܽܘ !',
        pCredits: 'Eastern Lyrics:\n' +
            'ܬܹܐ ܡܘܿܢ ܡܛܲܐܠܲܚ ܠܲܡܛܲܐܲܠܬܵܐ ܕܪܸܩܕܵܐ! ܡܲܬܘܿܒ݂ܘܿܢ ܒܒܵܠܵܘܟ݂ܘܿܢ. ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ، ܒܟܵܠܝܼܬܘܿܢ! ܘܐܸܢ ܐܵܡܪܸܢ ܪܩܘܿܕܘܿܢ، ܒܪܵܩܕܝܼܬܘܿܢ!\n' +
            'ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܒܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ!\n' +
            'ܗܵܕܝܼܵܐ ܡܛܲܝܒ݂ܘܿܢ ܢܲܦ̮ܫܵܘܟ݂ܘܿܢ ܠܲܫܘܵܪܵܐ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܫܘܘܿܪܘܿܢ ܡ̣ܢ ܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ!\n' +
            'ܗܵܕܝܼܵܐ ܡܛܲܝܒ݂ܘܿܢ ܢܲܦ̮ܫܵܘܟ݂ܘܿܢ ܠܲܫܥܵܫܵܐ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܫܥܘܿܫܘܿܢ ܡ̣ܢ ܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ\n' +
            'ܗܵܕܝܼܵܐ ܡܛܲܝܒ݂ܘܿܢ ܢܲܦ̮ܫܵܘܟ݂ܘܿܢ ܠܲܦܬܵܠܵܐ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܦܬܘܿܠܘܿܢ ܡ̣ܢ ܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ\n' +
            'ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܟܡܵܐ ܕܡܵܨܝܼܬܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܪܩܘܿܕܘܿܢ ܒܟܠܹܗ ܕܠܸܒܵܘܟ݂ܘܿܢ ܟܠܹܐ ܡܘܿܢ ܐܝܼܡܲܢ ܕܐܵܡܪܸܢ ܟܠܹܐ ܡܘܿܢ!',
        pSubImages: SubSongsImagesListViewWidget(
            subImagesCount: subImagesURL.length,
            subImagesURL: subImagesURL,
            containerHeight: height * 1 / 4,
            imageWidth: width * 3 / 8,
            imageHeight: height * 3 / 16),
      ),
    ];
    return sItem;
  }
}
